import streamlit as st
#import streamlit.components.v1 as components # Unused

if 'sidebar_state' not in st.session_state:
    st.session_state.sidebar_state = 'collapsed'

# Streamlit set_page_config method has a 'initial_sidebar_state' argument that controls sidebar state.
st.set_page_config(page_title='圣者贤行愿王释义',layout="wide",initial_sidebar_state=st.session_state.sidebar_state)

#st.set_page_config(page_title='view chart',layout="wide")
st.sidebar.header('普贤行愿')


title = '圣者贤行愿王释义'
# st.title(title) 
st.markdown(f'# {title}')
st.markdown('#### 章嘉游戏金刚造 藏文汉译汤芗铭译')

col1, col2, col3 = st.columns(3)


with col1:
    """
    ### 普贤行愿品
    唐 般若三藏译
    """

    st.code(
    """
    所有十方世界中  
    三世一切人师子  
    我以清净身语意  
    一切遍礼尽无余 
    普贤行愿威神力  
    普现一切如来前  
    一身复现刹尘身  
    一一遍礼刹尘佛 
    于一尘中尘数佛  
    各处菩萨众会中  
    无尽法界尘亦然  
    深信诸佛皆充满 
    各以一切音声海  
    普出无尽妙言辞  
    尽于未来一切劫  
    赞佛甚深功德海 
    以诸最胜妙华鬘  
    伎乐涂香及伞盖  
    如是最胜庄严具  
    我以供养诸如来 
    最胜衣服最胜香 
    末香烧香与灯烛  
    一一皆如妙高聚  
    我悉供养诸如来 
    我以广大胜解心 
    深信一切三世佛 
    悉以普贤行愿力 
    普遍供养诸如来 
    我昔所造诸恶业 
    皆由无始贪嗔痴 
    从身语意之所生 
    一切我今皆忏悔 
    十方一切诸众生 
    二乘有学及无学 
    一切如来与菩萨 
    所有功德皆随喜 
    十方所有世间灯 
    最初成就菩提者 
    我今一切皆劝请 
    转于无上妙法轮 
    诸佛若欲示涅槃 
    我悉至诚而劝请 
    唯愿久住刹尘劫 
    利乐一切诸众生 
    所有礼赞供养福 
    请佛住世转法轮 
    随喜忏悔诸善根 
    回向众生及佛道 
    我随一切如来学 
    修习普贤圆满行 
    供养过去诸如来 
    及与现在十方佛 
    未来一切天人师 
    一切意乐皆圆满 
    我愿普随三世学 
    速得成就大菩提 
    所有十方一切刹 
    广大清净妙庄严 
    众会围绕诸如来 
    悉在菩提树王下 
    十方所有诸众生 
    愿离忧患常安乐 
    获得甚深正法利 
    灭除烦恼尽无余 
    我为菩提修行时 
    一切趣中成宿命 
    常得出家修净戒 
    无垢无破无穿漏 
    天龙夜叉鸠槃荼 
    乃至人与非人等 
    所有一切众生语 
    悉以诸音而说法 
    勤修清净波罗蜜 
    恒不忘失菩提心 
    灭除障垢无有余 
    一切妙行皆成就 
    于诸惑业及魔境 
    世间道中得解脱 
    犹如莲华不著水 
    亦如日月不住空 
    悉除一切恶道苦 
    等与一切群生乐 
    如是经于刹尘劫 
    十方利益恒无尽 
    我常随顺诸众生 
    尽于未来一切劫 
    恒修普贤广大行 
    圆满无上大菩提 
    所有与我同行者 
    于一切处同集会 
    身口意业皆同等 
    一切行愿同修学 
    所有益我善知识 
    为我显示普贤行 
    常愿与我同集会 
    于我常生欢喜心 
    愿常面见诸如来 
    及诸佛子众围绕 
    于彼皆兴广大供 
    尽未来劫无疲厌 
    愿持诸佛微妙法 
    光显一切菩提行 
    究竟清净普贤道 
    尽未来劫常修习 
    我于一切诸有中 
    所修福智恒无尽 
    定慧方便及解脱 
    获诸无尽功德藏 
    一尘中有尘数刹 
    一一刹有难思佛 
    一一佛处众会中 
    我见恒演菩提行 
    普尽十方诸刹海 
    一一毛端三世海 
    佛海及与国土海 
    我遍修行经劫海 
    一切如来语清净 
    一言具众音声海 
    随诸众生意乐音 
    一一流佛辩才海 
    三世一切诸如来 
    于彼无尽语言海 
    恒转理趣妙法轮 
    我深智力普能入 
    我能深入于未来 
    尽一切劫为一念 
    三世所有一切劫 
    为一念际我皆入 
    我于一念见三世 
    所有一切人师子 
    亦常入佛境界中 
    如幻解脱及威力 
    于一毛端极微中 
    出现三世庄严刹 
    十方尘刹诸毛端 
    我皆深入而严净 
    所有未来照世灯 
    成道转法悟群有 
    究竟佛事示涅槃 
    我皆往诣而亲近 
    速疾周遍神通力 
    普门遍入大乘力 
    智行普修功德力 
    威神普覆大慈力 
    遍净庄严胜福力 
    无著无依智慧力 
    定慧方便威神力 
    普能积集菩提力 
    清净一切善业力 
    摧灭一切烦恼力 
    降伏一切诸魔力 
    圆满普贤诸行力 
    普能严净诸刹海 
    解脱一切众生海 
    善能分别诸法海 
    能甚深入智慧海 
    普能清净诸行海 
    圆满一切诸愿海 
    亲近供养诸佛海 
    修行无倦经劫海 
    三世一切诸如来 
    最胜菩提诸行愿 
    我皆供养圆满修 
    以普贤行悟菩提 
    一切如来有长子 
    彼名号曰普贤尊 
    我今回向诸善根 
    愿诸智行悉同彼 
    愿身口意恒清净 
    诸行刹土亦复然 
    如是智慧号普贤 
    愿我与彼皆同等 
    我为遍净普贤行 
    文殊师利诸大愿 
    满彼事业尽无余 
    未来际劫恒无倦 
    我所修行无有量 
    获得无量诸功德 
    安住无量诸行中 
    了达一切神通力 
    文殊师利勇猛智 
    普贤慧行亦复然 
    我今回向诸善根 
    随彼一切常修学 
    三世诸佛所称叹 
    如是最胜诸大愿 
    我今回向诸善根 
    为得普贤殊胜行 
    愿我临欲命终时 
    尽除一切诸障碍 
    面见彼佛阿弥陀 
    即得往生安乐刹 
    我既往生彼国已 
    现前成就此大愿 
    一切圆满尽无余 
    利乐一切众生界 
    彼佛众会咸清净 
    我时于胜莲华生 
    亲睹如来无量光 
    现前授我菩提记 
    蒙彼如来授记已 
    化身无数百俱胝 
    智力广大遍十方 
    普利一切众生界 
    乃至虚空世界尽 
    众生及业烦恼尽 
    如是一切无尽时 
    我愿究竟恒无尽 
    十方所有无边刹 
    庄严众宝供如来 
    最胜安乐施天人 
    经一切刹微尘劫 
    若人于此胜愿王 
    一经于耳能生信 
    求胜菩提心渴仰 
    获胜功德过于彼 
    即常远离恶知识 
    永离一切诸恶道 
    速见如来无量光 
    具此普贤最胜愿 
    此人善得胜寿命 
    此人善来人中生 
    此人不久当成就 
    如彼普贤菩萨行 
    往昔由无智慧力 
    所造极恶五无间 
    诵此普贤大愿王 
    一念速疾皆消灭 
    族姓种类及容色 
    相好智慧咸圆满 
    诸魔外道不能摧 
    堪为三界所应供 
    速诣菩提大树王 
    坐已降伏诸魔众 
    成等正觉转法轮 
    普利一切诸含识 
    若人于此普贤愿 
    读诵受持及演说 
    果报唯佛能证知 
    决定获胜菩提道 
    若人诵此普贤愿 
    我说少分之善根 
    一念一切悉皆圆 
    成就众生清净愿 
    我此普贤殊胜行 
    无边胜福皆回向 
    普愿沉溺诸众生 
    速往无量光佛刹 
    """
    ,
    language='Markdown',line_numbers=True)
    #,
    #line_numbers=True)

with col2:
 """
 ### 普賢行願讚
 唐 不空三藏譯
 """
 st.code(
 """
 所有十方世界中 
 一切三世人師子 
 我今禮彼盡無餘 
 皆以清淨身口意 
 身如剎土微塵數 
 一切如來我悉禮 
 皆以心意對諸佛 
 以此普賢行願力 
 於一塵端如塵佛 
 諸佛佛子坐其中 
 如是法界盡無餘 
 我信諸佛悉充滿 
 於彼無盡功德海 
 以諸音聲功德海 
 闡揚如來功德時 
 我常讚歎諸善逝 
 以勝花鬘及塗香 
 及以伎樂勝傘蓋 
 一切嚴具皆殊勝 
 我悉供養諸如來 
 以勝衣服及諸香 
 末香積聚如須彌 
 殊勝燈明及燒香 
 我悉供養諸如來 
 所有無上廣大供 
 我悉勝解諸如來
 以普賢行勝解力 
 我禮供養諸如來 
 我曾所作眾罪業 
 皆由貪欲瞋恚癡 
 由身口意亦如是 
 我皆陳說於一切 
 所有十方群生福 
 有學無學辟支佛 
 及諸佛子諸如來 
 我皆隨喜咸一切 
 所有十方世間燈 
 以證菩提得無染 
 我今勸請諸世尊 
 轉於無上妙法輪 
 所有欲現涅槃者 
 我皆於彼合掌請 
 唯願久住剎塵劫 
 為諸群生利安樂 
 禮拜供養及陳罪 
 隨喜功德及勸請 
 我所積集諸功德 
 悉皆迴向於菩提 
 於諸如來我修學 
 圓滿普賢行願時 
 願我供養過去佛 
 所有現住十方世
 所有未來速願成 
 意願圓滿證菩提 
 所有十方諸剎土 
 願皆廣大咸清淨 
 諸佛咸詣覺樹王 
 諸佛子等皆充滿 
 所有十方諸眾生 
 願皆安樂無眾患 
 一切群生獲法利 
 願得隨順如意心 
 我當菩提修行時 
 於諸趣中憶宿命 
 若諸生中為生滅 
 我皆常當為出家
 戒行無垢恆清淨 
 常行無缺無孔隙 
 天語龍語夜叉語 
 鳩槃荼語及人語 
 所有一切群生語 
 皆以諸音而說法 
 妙波羅蜜常加行 
 不於菩提心生迷 
 所有眾罪及障礙 
 悉皆滅盡無有餘 
 於業煩惱及魔境 
 世間道中得解脫
 猶如蓮華不著水 
 亦如日月不著空 
 諸惡趣苦願寂靜 
 一切群生令安樂
 於諸群生行利益 
 乃至十方諸剎土 
 常行隨順諸眾生 
 菩提妙行令圓滿 
 普賢行願我修習 
 我於未來劫修行 
 所有共我同行者 
 共彼常得咸聚會
 於身口業及意業 
 同一行願而修習 
 所有善友益我者 
 為我示現普賢行
 共彼常得而聚會 
 於彼皆得無厭心 
 常得面見諸如來 
 與諸佛子共圍繞 
 於彼皆興廣供養 
 皆於未來劫無倦 
 常持諸佛微妙法 
 皆令光顯菩提行
 咸皆清淨普賢行 
 皆於未來劫修行 
 於諸有中流轉時 
 福德智慧得無盡
 般若方便定解脫 
 獲得無盡功德藏 
 如一塵端如塵剎 
 彼中佛剎不思議
 佛及佛子坐其中 
 常見菩提勝妙行 
 如是無量一切方 
 於一毛端三世量
 佛海及與剎土海 
 我入修行諸劫海 
 於一音聲功德海 
 一切如來清淨聲
 一切群生意樂音 
 常皆得入佛辯才 
 於彼無盡音聲中 
 一切三世諸如來
 當轉理趣妙輪時 
 以我慧力普能入 
 以一剎那諸未來 
 我入未來一切劫
 三世所有無量劫 
 剎那能入俱胝劫 
 所有三世人師子 
 以一剎那我咸見
 於彼境界常得入 
 如幻解脫行威力 
 所有三世妙嚴剎 
 能現出生一塵端 
 如是無盡諸方所 
 能入諸佛嚴剎土 
 所有未來世間燈 
 彼皆覺悟轉法輪
 示現涅槃究竟寂 
 我皆往詣於世尊 
 以神足力普迅疾 
 以乘威力普遍門 
 以行威力等功德 
 以慈威力普遍行 
 以福威力普端嚴 
 以智威力無著行 
 般若方便等持力 
 菩提威力皆積集 
 皆於業力而清淨 
 我今摧滅煩惱力 
 悉能降伏魔羅力 
 圓滿普賢一切力 
 普令清淨剎土海 
 普能解脫眾生海 
 悉能觀察諸法海 
 及以得源於智海 
 普令行海咸清淨 
 又令願海咸圓滿 
 諸佛海會咸供養 
 普賢行劫無疲倦 
 所有三世諸如來 
 菩提行願眾差別 
 願我圓滿悉無餘 
 以普賢行悟菩提 
 諸佛如來有長子 
 彼名號曰普賢尊
 皆以彼慧同妙行 
 迴向一切諸善根 
 身口意業願清淨 
 諸行清淨剎土淨 
 如彼智慧普賢名 
 願我於今盡同彼 
 普賢行願普端嚴 
 我行曼殊室利行 
 於諸未來劫無倦 
 一切圓滿作無餘 
 所須勝行無能量 
 所有功德不可量 
 無量修行而住已 
 盡知一切彼神通 
 乃至虛空得究竟 
 眾生無餘究竟然 
 及業煩惱乃至盡 
 乃至我願亦皆盡 
 若有十方無邊剎 
 以寶莊嚴施諸佛 
 天妙人民勝安樂 
 如剎微塵劫捨施 
 若人於此勝願王 
 一聞能生勝解心 
 於勝菩提求渴仰 
 獲得殊勝前福聚 
 彼得遠離諸惡趣 
 彼皆遠離諸惡友 
 速疾得見無量壽 
 唯憶普賢勝行願 
 得大利益勝壽命 
 善來為此人生命 
 如彼普賢大菩薩 
 彼人不久當獲得 
 所作罪業五無間 
 由無智慧而所作 
 彼誦普賢行願時 
 速疾消滅得無餘 
 智慧容色及相好 
 族性品類得成就
 於魔外道得難摧 
 常於三界得供養 
 速疾往詣菩提樹 
 到彼坐已利有情
 覺悟菩提轉法輪 
 摧伏魔羅并營從 
 若有持此普賢願 
 讀誦受持及演說
 如來具知得果報 
 得勝菩提勿生疑 
 如妙吉祥勇猛智 
 亦如普賢如是智 
 我當習學於彼時 
 一切善根悉迴向
 一切三世諸如來 
 以此迴向殊勝願 
 我皆一切諸善根 
 悉已迴向普賢行 
 當於臨終捨壽時 
 一切業障皆得轉 
 親覩得見無量光 
 速往彼剎極樂界 
 得到於彼此勝願 
 悉皆現前得具足 
 我當圓滿皆無餘 
 眾生利益於世間 
 於彼佛會甚端嚴 
 生於殊勝蓮華中
 於彼獲得受記莂 
 親對無量光如來 
 於彼獲得受記已 
 變化俱胝無量種 
 廣作有情諸利樂 
 十方世界以慧力 
 若人誦持普賢願 
 所有善根而積集
 以一剎那得如願 
 以此群生獲勝願 
 我獲得此普賢行 
 殊勝無量福德聚
 所有群生溺惡習 
 皆往無量光佛宮 
 """
 ,
 language='Markdown',line_numbers=True)

with col3:
  """
  ### 贤行愿王
  民国 汤芗铭译
  """

  st.code(
  """
    所有十方世界中 
    游于三世人师子
    我以清净身语意 
    遍礼一切悉无余
    以彼贤行为愿力 
    一切如来意现前
    一身复现刹尘身 
    一一遍礼刹尘佛
    于一尘中尘数佛 
    各住菩萨众会中
    无尽法界亦复然
    我信诸佛皆充满
    诸功德海赞无尽 
    普以音支大海声
    称扬一切佛功德 
    我今赞叹诸善逝
    以诸妙华妙华鬘 
    伎乐涂香胜伞盖
    最胜灯明妙烧香 
    我悉供养诸如来
    诸妙衣服最胜香 
    末香积等妙高峰
    一切最胜庄严具 
    我悉供养诸如来
    所有无上广大供 
    我悉胜解诸如来
    深心信受贤行力 
    顶礼供养诸如来
    我由贪嗔痴增上 
    从身语意之所起
    诸所造作恶不善 
    一切我今别别悔
    十方一切佛菩萨 
    独觉有学及无学
    一切趣中诸有情 
    所有福善我随喜
    十方所有世间灯 
    现证菩提得无滞
    我今劝请诸世尊 
    转于无上妙法轮
    诸佛若欲示涅槃 
    我悉合掌而劝请
    利乐一切有情故 
    唯愿久住刹尘劫
    敬礼供养悔露罪 
    随喜劝转请常住
    尽我所积少善根 
    一切回向大菩提
    供养过去一切佛 
    现住十方世界佛
    未来意乐速圆满 
    依次现证佛菩提
    所有十方诸刹土 
    愿皆广大极清净
    于中菩提树王下 
    诸佛佛子咸充满
    十方所有诸有情 
    愿无疾病常安乐
    众生法利悉顺成 
    所有意望亦成满
    我为修行菩提行 
    一切趣中念本生
    诸余生中受生死 
    愿我常得趣出家
    我随一切如来学 
    毕竟圆满其贤行
    戒行清净无污垢 
    恒不毁犯无过行
    天语龙语药叉语 
    鸠槃荼语及人语
    所有诸趣一切语 
    我以诸音为说法
    淳善精勤修诸度 
    恒不忘失菩提心
    所有诸罪能为障 
    愿皆清净悉无余
    业与烦恼诸魔事 
    世间趣中得解脱
    犹如莲华不著水 
    日月经行不滞空
    尽刹土量诸方所
    息灭恶趣一切苦
    善能安处有情乐
    一切趣中行利益
    毕竟圆满菩提行 
    趣入随顺有情行
    极善开演其贤行 
    尽未来劫普修行
    所有与我等行行 
    愿得常与彼共住
    身业口业及意业 
    同行同愿而修行
    所有益我善知识 
    为我显示其贤行
    我愿常与彼会遇 
    于彼从不拂其心
    佛子所绕诸世尊 
    我常现前亲面对
    尽未来劫无厌倦 
    皆为兴起广大供
    摄持一切佛正法 
    普能光显菩提行
    极善净治其贤行 
    尽未来劫常修行
    亦能流转诸有中 
    所获福智皆无尽
    方便胜慧定解脱 
    成诸功德无尽藏
    一微尘中尘数刹 
    一一刹有难思佛
    安住菩萨众会中 
    行菩提行当观见
    如是无余一切方 
    一毛端许三世量
    佛海及诸刹土海 
    劫海修行善趣入
    一语音支大海声 
    一切如来净音支
    普随诸趣如意音 
    常得趣入于佛语
    游于三世一切佛 
    法轮理趣恒常转
    于诸所转无尽音 
    以觉慧力我趣入
    趣入未来一切劫 
    一刹那顷我趣入
    所有三世诸劫量 
    依刹那分而趣入
    一刹那顷我观见 
    游于三世人师子
    恒于彼等所行境 
    幻解脱力能趣入
    一微尘中能引发 
    所有三世庄严土
    如是无余一切方 
    趣入庄严诸佛土
    所有未来世间灯 
    次第成佛转法轮
    示现涅槃究竟寂 
    诸世尊前我往诣
    普遍速疾神境力 
    普门趣入法乘力
    普遍修行功德力 
    普能遍满大慈力
    普遍贤善福德力 
    无有滞碍大智力
    般若方便静虑力 
    大菩提力皆引发
    善能清净诸业力 
    普能损伏烦恼力
    一切魔力令无力 
    善能圆满贤行力
    善能净治刹土海 
    善能解脱有情海
    善能观察诸法海 
    善能通达于智海
    善能清净诸行海 
    善能圆满诸愿海
    善能供养诸佛海 
    修行无倦经劫海
    所有游于三世佛 
    菩提行愿广差别
    为依贤行现菩提 
    一切无余我圆满
    一切如来有长子 
    彼名号曰普贤尊
    为与善巧同等行 
    回向今此一切善
    身语意业皆清净 
    诸行清净刹清净
    贤巧云何善回向 
    愿我与彼皆同等
    为行普善贤行故 
    修行文殊师利愿
    尽未来劫无厌倦 
    满彼事业尽无余
    所应修行无有量 
    一切功德亦无量
    安住无量诸行已 
    晓了彼等诸神变
    虚空岂是尔许边 
    无余有情边亦然
    岂业烦恼边尔许 
    我愿亦岂尔许边
    若以十方无边刹 
    众宝庄严供如来
    复以人天最胜乐 
    刹尘数劫常奉献
    若有闻此回向王 
    随顺胜解大菩提
    暂一于此能生信 
    获胜福德过于彼
    诸有发此贤行愿 
    彼能远离诸恶趣
    彼亦远离诸恶友 
    彼速亲亲无量光
    善得应得乐安养 
    今此人寿亦善来
    经时不久彼当得 
    有如普贤所成就
    诸造极恶五无间 
    皆由无知增上力
    愿彼称诵此贤行 
    速疾无余悉清净
    智与形色诸相好 
    种姓容颜悉具有
    诸魔外道无力能 
    普为三界所应供
    速诣菩提树王下 
    到已安住为利生
    降伏一切魔部众 
    成等正觉转法轮
    诸有于此贤行愿 
    受持开演读诵者
    异熟唯佛能证知 
    得胜菩提勿疑惑
    文殊勇猛如实知 
    普贤菩萨亦如是
    我普于彼随学故 
    回向今此一切善
    三世诸佛咸称赞 
    如是回向最殊胜
    我亦普以此善根 
    回向为令依贤行
    愿我临欲命终时 
    普能扫除一切障
    亲睹如来无量光 
    即得往生极乐土
    到彼土已令此愿 
    一切无余悉现前
    无余彼愿我圆满 
    利益世间诸有情
    彼佛中围贤调悦 
    我从端严妙莲生
    亲睹如来无量光 
    我于其中得记别
    既得如来记别已 
    化众多身百俱胝
    依觉慧力遍十方 
    广作利益诸有情
    我今发此贤行愿 
    随有所积少分善
    愿彼有情诸善愿 
    刹那一切悉相应
    以此贤行愿回向 
    所获福德胜无边
    沉溺苦海诸有情 
    往生无量光佛土
    """
    ,
    language='Markdown',line_numbers=True)




"""
1.  贤行愿王藏文汉译

1.  凡例

1.  译序

1.  甲一、释经题
1.  甲二、释译师敬礼
1.  甲三、释所为相属
1.  甲四、释经义—经中所明缘起理趣
1.  甲四、释经义—梵土诸疏所释理趣
1.  甲四、释经义—正释经义—成就愿因，积集净治修学次第
1.  甲四、释经义—正释经义—正修菩萨愿之次第
1.  甲四、释经义—正释经义—作意思惟此愿胜利
1.  甲四、释经义—正释经义—诵持文等一切胜利
1.  自序注释
1.  释论注释

"""

"""
## 凡例

一、本经圆摄一切佛子广大之行，及其薰习一切菩萨道次第之因果。如释义释经云：所诠洪广，望所余愿最极殊胜，故名为王。又如经云：
  ```
  诸有于此贤行愿，受持开演读诵者，
  异熟唯佛能证知，得胜菩提勿疑惑。
  ```
二、为方便学者读诵受持，普沾法益，谨将经文恭印于释论之前；经句下的正楷数字，则供易于查对文中释义之用。

三、本经于坊间，能教证合一的解释尤为稀有难得。此释论作者至尊章嘉游戏金刚，为清代国师，实证实修，学行具足。今特恭印，以供各方参学。

四、本论属释经义之论，故名释义。内容概分：‘经文’、‘释义’二部分。为使眉目分明，经文部分全用正楷字体；释义本文则用明体字，科判另拣黑字标出，以开显纲目。

五、有几处译文，以（）号括出，酌加用字，为顺文气，并示有别。但惟恐有误，尚祈十方大德不吝赐正，是所至祷。

## 圣者贤行愿王释义译序
#### 汤芗铭

此愿，梵名‘贤行愿王’（1），其义详于释经题科。梵疏（2）所释，亦各不同，略举二说：

一、陈那菩萨释云：‘贤，即是善。于善能行，是名贤行，即菩萨行。希愿贤行之愿，是名为愿。’义谓此愿，即行善之愿，亦即行菩萨行之愿也。

二、释迦知识释云：‘所言贤者，谓普贤菩萨。以此菩萨虽一烦恼所作，亦不可得，普于一切加行、正行，一切种中，至极妙善，故名普贤（3）。贤行愿者，即此菩萨修行相中所有正愿。’

以要言之，普贤菩萨综合一切菩萨修菩萨行所有诸相，制立为愿，名贤行愿；胜过所余一切正愿，故名为王。中土古德皆译之为普贤行愿，名虽不符，义则未失。何以故？以彼一切菩萨之行，即是普遍皆贤之行，亦即普贤菩萨之行。是以陈那所造释论，名为普贤行愿摄义。章嘉所造弁颂跋颂中，曰：‘普贤行愿广大海’，又曰：‘俱到普贤行海边’，仍皆称为普贤行也。惟此愿义，是愿修习普贤行之愿，不应读为‘普贤菩萨行其愿耳！’夫经名者，总摄经义；经名不正，经义难明。今为正名，故略征引而辨证之。除经名外，拙译颂文尚有多处异古译者，但参释义，其理自明，今不具述焉。读者幸勿于其异乎古译之处，误谓专依藏本所传，须知梵本今犹存在，可对证也。

昔清凉国师云：‘西域相传：普贤行愿赞为略华严经；大方广佛华严经，为广普贤行愿赞’。故知此愿胜利极大，广如经文释文所明。梵土（4）、西藏两地行人，或自课诵，或为他人起修福事，或大众中会修福事，无不诵之，发愿回向。唐代不空三藏专译愿文，藏土亦以愿文单行流通，供众持诵。然持其文，不明其义，但依口诵，未获思惟，不名‘圆满’。故今依据藏本章嘉游戏金刚所造释文，传为华言，使后学者得依其文而思其义也。

考此释文，广取梵土菩萨所造释论综辑成书，文义完美。梵土释论原有六种：

    一、圣者贤行愿王疏 龙猛造
    
    二、普贤行愿摄义………………陈那造
    
    三、圣者贤行愿王广疏…………释迦知识造
    
    四、圣者贤行愿王大疏…………庄严贤造
    
    五、圣者贤行愿王注……………世亲造
    
    六、贤行四疏释义备忘录………智军造

往昔清凉大师科释此愿，依据般若三藏译文。然此译文，与不空译、炖煌二译及藏译本，文句次第极为殊异。欲依其文科判愿义，是为甚难！此义别于五译合行绪中明之。为求翻译章嘉译文，不得不依藏本经文译其句颂，庶几读者依颂寻释，即能明了诸地菩萨愿之次第也。岂敢以此启诸宏达？但欲利益僻壤穷乡诸初发心者耳！良以此类初修业者，既乏经论参究其义，复无辞典探考其名，故今译文特立四种殊胜方便焉。

一、翻译名辞：就中一分，沿用般若三藏所译，为顺此土熟读旧译诸士夫故，一分改用奘师所译，以其译名堪能契合梵、藏语故。当知译名，或译文句，若求专合中土习尚，虽易通俗，毕竟失去本来面目，亦必遗漏本来精义。且于余处不通用时，定须别译通俗名文，以资补救。若一名辞，或一文句，出演多种不同译法，后之读者将焉会通？

二、注释名辞：为令利益初发心者，于释名辞不厌繁琐。又此训释引奘译外，有时复引旧译经论，俾初学人易于了解。

三、注释释文：章嘉释文广取经论精义为注，此于藏人习见习闻，殊易了解。其有中土所未见闻，或虽见闻，隐僻未显，故释文下补加小注，略释其义。

四、略添梵疏：藏译愿文虽为句颂，然文显了，无异长行，易于通晓。华言厄于字数句法，诸多难解。今为略添陈那、驿迦知识二师所造释论，补释经中难解文句。

中土相传，此愿在华严经中；然勘藏本，所谓六十华严、八十华严之全部，实名大方广佛经也。华严经为大方广佛经之一部分，如：佛驮跋陀罗所谓大方广佛华严经第四十四至第六十卷中之第三十四品入法界品；实叉难陀所译大方广佛华严经第六十至第八十卷中之第三十九品入法界品；般若所译大方广佛华严经入不可思议解脱境界普贤行愿品。及西秦圣坚所译罗摩伽经，则名华严经也。盖十地、华严等经之隶于大方广佛经中，亦犹三律仪等经之隶于大宝积经中，此则部品所属，不可不辨者也。

上来略述新译经名、释文、颂文，旧译部品所属诸事，甚矣译经之难也。藏称译师为世间眼，其尊重翻译也如彼。吾土古法建立译场，先由西方智者依于梵本口授，次由众多精通华言大德笔受，证梵、证汉，各有专司，其敬慎将事也如此。然者藏本，犹有旧译、新译不同。后依梵本，并参释论，几经审订，方成善本。又考吾土，即此古译五种愿文，略为会勘，尚复显出种种文句不同之处。况我下愚，孑然一身，以管窥天，依文揣义，敢云无失于本义乎？谨效章嘉所造露文，用以自露。文曰：

‘牟尼密意深且细，以我愚夫极愚者；
当有颠倒传译过，至心露于菩萨所。’

民国壬午季春 蕲水汤芗铭志于北海公园正觉殿菩提学会

## 圣者贤行愿王释义［亦名演密］

俱胝福善所庄严，三界唯一最尊上；

无障智如大日光，遍明一切所知事。

深广悦耳梵音声，阅演有情妙善道；

无等大师大悲藏，至心恭敬为作礼。［礼释迦佛］

戏现住地佛子相，无边刹土行佛事；
摄持大海功德戒，普贤文殊我敬礼。［礼梵、西藏智者］

摩尼深义所充满，普遍密布加持鬘；
大乘种性端严王，龙尊俱胝善依止。［明依智者所造释论］（1）

佛子于佛希有行，亿万河流汇为一；
普贤行愿广大海，我今意乐分别释。［明造释论］

如来所说‘素怛缆’［谓契经，通称为经］中，梵土、西藏成就智者所造释论皆谓：今此贤行愿王为佛所说一切愿中，其所诠说，于深、于广，毕竟圆满；望所余愿，最为第一，咸共称许为愿中王。今释此愿，总标四门：

甲一、释经题。
甲二、释译师敬礼。
甲三、释所为相属。
甲四、释经义。

甲一、释经题

梵土语言有四大部。今此经名，依四语中所谓圣语，亦称梵语，名‘阿哩耶、拔达喇、匝哩耶、札尼达那、喇杂’。转为华言，‘阿哩耶’，谓圣者；‘拔达喇’，谓贤；‘匝哩耶’，谓行；‘札尼达那’，谓愿；‘喇杂’，谓王。是故译为圣者贤行愿王。［原本是说转为藏言，今省重译，直名华言。］

谓普贤菩萨以彼一切佛子（2）广大之行，圆满会集摄为一品而立为愿，所诠洪广，望所余愿最极殊胜，故名为王。

甲二、释译师敬礼

译师为求得加被故，护中断故，礼曼殊室利。是故说云：‘敬礼圣者曼殊室利童子菩萨’（3）。依文易解，不须别释。

甲三、释所为相属

谓胜解行菩萨、住大地菩萨（4），一切菩萨功德及行有如大海，是此所诠。于彼一切作意其境而发愿已，增长大乘种性（5）气力，现前安处深厚薰习一切菩萨道之次第，后文所说愿中所有现时胜利，亦得现前，是名所为（6）。既发愿已，究竟胜利现大菩提，是名正为［即华严五为中之第一为］。又此正为依于所为，而其所为依于所诠，是名相属。此中所为相属之义，虽诸梵疏皆未有说，一类藏疏别有说法，然亦上说至为妙善。

甲四、释经义有三：

（乙一、经中所明缘起理趣。乙二、梵土诸疏所释理趣。乙三、正释经义。）

乙一、经中所明缘起理趣

此为大方广佛经部中，华严经所说。善财童子依次亲近五十三尊善知识已，最后参觐普贤菩萨，由是因缘而说此愿。今为略述华严经义，于中事品有五十三。［已下名辞，多分沿用般若所译，为易对照其经文故］

第一事品：序说文殊师利菩萨渐次南行，至福生城，有长者子名曰：善财，于文殊前，发阿耨多罗三藐三菩提心。

第二事品：序说善财童子依所教示，亲诣南方胜乐国境，登妙峰山，谒吉祥云比丘。顶礼双足，右绕多匝，合掌曲躬，住其面前，启请开示诸菩萨行。为得随念如来法门，即由总持诸佛法云陀罗尼力，普见诸门，入无碍智，如实正闻开演法要。

第三事品：序说善财童子依所教示，渐次南行，诣海门国，谒海云比丘，礼请如前。为得普眼法门，听闻开演陀罗尼光普照明等。

第四事品：序说善财童子诣棱伽道海岸聚落，谒妙住比丘。见彼比丘住虚空界，无数眷属俱作供养。礼请如前。为得菩萨无碍解脱一切功德，如实正闻最堪称赞神通变化广大不可思议法门。

第五事品：序说善财童子诣南方达罗吒国金刚层城，谒弥伽大士，礼请如前。为从广说字轮相续庄严法门，获得妙音大陀罗尼，如实正闻最堪赞美一切言音及诸字轮究竟解脱。

第六事品：序说善财童子诣南住林，谒解脱长者。经十二年，至长者处，礼请如前。为入成就明智摄诸佛土三摩地力，加持如来甚深无碍解脱庄严，依所说法如实现前，观前听闻。

第七事品：序说善财童子诣阎浮提畔遍无垢处，谒海幢比丘，礼请如前。适此比丘，入于清净普庄严门三摩地中，不思议力光明普照，乃至六月，复经六日，无不明见。为依般若波罗密多，得普见舍所生光明三摩地门，依所说法如实现前，观见听闻。

第八事品：序说善财童子渐次南行，至海潮处普庄严园。中有摩尼妙宝所成无量宫殿，旁有大海以为庄严，见伊舍那优婆夷安住其中，众多眷属周围环绕。礼请如前。为得菩萨离忧安乐宝幢解脱，如实见闻，开示法数。

第九事品：序说善财童子往海潮处那罗素国，见彼仙人大威猛声，十千仙众，前后围绕。礼请如前。为令获得一切菩萨他无能胜解脱幢力，时彼大仙伸其右手摩善财顶，由难思议三摩地光，令其现前悉得观见，而得听闻广大开示。

第十事品：序说善财童子至伊沙那聚落，见胜热婆罗门，示修苦行，五热炙身，住金刚焰胜三摩地，放大光明。所住处所四面火聚，有险峻山罗列锋刀，于所示现心生疑惑。时有十千大梵天等无数大众，以神变力住虚空中，供养圣者，赞叹圣者真实功德，乃即止息所怀疑惑而悔过失，礼请如前。依于圣者所指示处，往登刀山，自投火聚，未至中间，即得菩萨善住坚牢净三摩地；才触火焰，复得寂静安乐神通三摩地。闻得菩萨赞美无尽中围解脱。

第十一事品：序说善财童子往南方狮子颦伸城，见无畏星宿幢王女，慈行童女住于毗卢遮那摩尼藏殿，五百童女以为侍从，礼请如前。为得般若波罗蜜多普庄严门，现前见闻开演正法。

第十二事品：序说善财童子诣三目国密林薮中，见妙见比丘相好庄严，无数天等前后围绕。献希有供，礼请如前。为得菩萨永无息灭明灯解脱，如实正闻所说法数。

第十三事品：序说善财童子诣圆满多闻国，入妙门城，于河渚上见根自在主童子，十千童子前后围绕，计沙为戏。见已亲近，礼请如前。为得菩萨应知诸法工巧差别神通相应明智三摩地，如实正闻开示法要。

第十四事品：序说善财童子诣海住城摩尼精舍，谒辩具足优婆夷，十千童女眷属围绕，面前安置无尽宝瓶，出生种种如意受用，一切妙宝庄饰其身，暂一睹见，便能获得无烦恼乐。礼请如前。为得菩萨无尽福藏庄严解脱，如实现前见闻说法。

第十五事品：序说善财童子诣大有城，见具足智长者在其城内市四衢道七宝台上，坐于众宝庄严法座，天庄严具以为严饰，十千眷属前后围绕。礼请如前。为得随意出生福藏解脱，如实现前见闻说法。

第十六事品：序说善财童子诣师子宫城，于市巷中，见尊法宝髻长者，礼请如前。尔时长者执善财手，示其所居庄严舍宅，为得菩萨无碍愿轮庄严解脱，如实现前见闻说法。

第十七事品：序说善财童子诣藤根国普遍门城，见普眼长者住市肆中鬻香药处。礼请如前。为得了知一切有情种种病缘悉能救疗，普见诸佛承事供养和香法门，如实正闻开示法要。

第十八事品：序说善财童子诣多罗幢城，见甘露火王众宝庄严，十千大臣前后围绕，十万猛卒形貌可畏，于行恶行一切人众，施以种种难忍刑罚。示现如是凶猛事业，即便生起不恭敬心。时虚空中有天相劝，闻天语已，前诣王所，礼请如前。王执其手将入宫内，示以宫殿及诸资具，为得菩萨如幻解脱如实现前，观见听闻宣说法要。

第十九事品：序说善财童子诣妙光城，其城普饰无数摩尼妙宝间杂庄严，见大光王住于光明照耀众生乐见宝宫殿中，无量资具，无数千亿端正好友，随众生心而为给施。礼请如前。为得菩萨大慈幢行，顺世三摩地解脱如实现前，观见听闻宣说法要。

第二十事品：序说善财童子诣安住城，谒不动优婆夷。此优婆夷住自宅中，其金色光由宅门出，如是光明触善财身，即时获得安乐自在三摩地等五百三摩地，身心柔软。尔时观见彼圣母身圆满，具足不可思议色相、容颜、一切功德，以颂赞颂，礼请如前。为得菩萨难行智藏解脱如实现前，观见听闻开示法要。

第二十一事品：序说善财童子诣都萨罗国，至都萨罗城。其城东北有一大山，名妙吉祥。于中夜时，见遍行外道在此山顶威光照耀，吉祥福焰过于炽火，大梵天王所不能及，十千梵众周围环绕。礼请如前。为得至一切处随顺遍行诸菩萨行，如实正闻开示法要。

第二十二事品：序说善财童子诣广博国，谒鬻香长者，具足优钵罗花，礼请如前。为得了知调和诸香，兴不思议大香法云，降不思议细香法雨等，如实正闻开示法要。

第二十三事品：序说善财童子诣楼阁城，于城门外，见婆施罗船师住海岸上，为彼大众百千商人、百千生灵，以海言音而为说法。礼请如前。为得菩萨江河音声，若见、若闻，忆念、共住，得解脱法，如实正闻开示法要。

第二十四事品：序说善财童子渐次往诣乐璎珞城，见最胜长者在城东方大庄严幢无忧林中，百千长者众所围绕，理断人间种种事务，宣扬一切出世法音。善财见已，称名祈请，为得至一切处净菩萨行，无体、无依、无作、无住神通威力庄严法门，如实正闻开示法要。

第二十五事品：序说善财童子诣无边河，谒陵迦林，在胜光王自所施舍日光园中，见狮子颦伸比丘尼，坐于难思众宝庄严形如楼阁宝树下方大狮子座，从其无边三摩地门，为大菩萨无数大众开示无边种种法门。礼请如前。为得菩萨灭除一切微细分别解脱，如实见闻开示法要。

第二十六事品：序说善财童子诣险难国宝庄严城，于此城内市廛之北，众宝合成大楼阁中，见伐苏蜜多女，妙宝璎珞上下严饰，从其身出广大光明，遇斯光者，令其获得欢喜光明。礼请如前。为得菩萨远离贪欲边际解脱，如实正闻开示法要。

第二十七事品：序说善财童子诣彼岸城，谒毗瑟底罗居士，礼请如前。为得菩萨不般涅槃边际解脱，如实正闻开示法要。

第二十八事品：序说善财童子诣南海补怛洛迦山，于其西面蓊郁林中，见观自在菩萨坐于金刚宝石台上，为无量数菩萨大众，宣说普能摄受一切有情大慈大悲法门。尔时童子前往其所，礼请如前，以妙赞音作赞颂已，蒙彼菩萨舒其右手摩善财顶。为得菩萨大悲行无碍门，如实正闻开示法要。

第二十九事品：序说有大菩萨名正性无异行，从彼东方上虚空界无量刹海，至此世界轮围山顶，以足触地，时此世界六种震动，示现种种神境相已，皆大欢喜，然后来至圣者观自在菩萨所。善财童子礼请如前。为得菩萨遍行解脱，如实正闻开示法要。

第三十事品：序说善财童子诣门主城，见大天神长舒四臂，取四海水自洗其面，持诸金花以散善财，以所化现堪赞宝聚无尽受用，施于善财。礼请如前。为得菩萨云网解脱，如实正闻开示法要。

第三十一事品：序说善财童子诣东北方趣摩竭国菩提树王大道场处，有自性不动神以足触地，示现无数摩尼宝藏悉从善财福力所生，而施与之。礼请如前。为得菩萨难行智藏解脱，如实正闻开示法要。

第三十二事品：序说善财童子诣恒河岸迦毗罗城，遇日没时，见春和夜神住于彼城虚空界中，形貌端严，炳然显现，一一毛孔皆现化度无量有情。礼请如前。为得菩萨教化调伏破一切有情痴暗法光明解脱，如实正闻开示法要。

第三十三事品：序说善财童子诣摩竭提国菩提场中，谒普遍吉祥无垢光主夜神，礼请如前。为得菩萨寂乐静虑遍伏解脱，如实正闻开示法要。

第三十四事品：序说善财童子诣菩提树王道场右面，见喜目观察众生夜神在于如来众会道场，坐莲华藏狮子之座，入大速疾普贤喜幢无垢解脱三摩地门。从彼一一毛孔，悉现普贤无边游戏变化身云。尔时善财获得菩萨普贤喜幢大海光明，以颂赞颂，礼请如前。为得菩萨大速疾力，普贤喜幢无垢解脱，如实正闻开示法义。

第三十五事品：序说善财童子于上所说如来大众会中，谒普救众生威德吉祥夜神，示现菩萨调伏众生解脱神力，以诸相好庄严其身。从其白毫放大光明，触善财身，即时获得远离尘垢静虑中围。见彼道中一切微尘刹海庄严，心大欢喜，以颂赞叹。时彼夜神还复本形，而仍示现神通变化。礼请如前。为得菩萨普现一切世间调伏众生解脱，如实正闻开示法要。

第三十六事品：序说善财童子诣菩提场，谒具足功德寂静音主夜神，礼请如前。为得菩萨念念出生广大欢喜庄严解脱，如实正闻开示法要。

第三十七事品：序说善财童子诣菩提场如来清净圆满会中，见守护一切城增长威德主夜神，坐于光明普照一切宫殿中，摩尼宝王大莲花藏狮子之座，百千夜神而为眷属，前后围绕。礼请如前。为得菩萨甚深自在可爱妙音解脱，如实正闻开示法要。

第三十八事品：序说善财童子诣菩提场佛众会中，谒开敷一切树华安乐主夜神，见其身在众宝香树枝条楼阁，坐大宝树苗藏狮子座上，十千夜神前后围绕。礼请如前。为得菩萨出生广大欢喜光明解脱，如实正闻开示法要。

第三十九事品：序说善财童子诣菩提场如来会中，见精进守护一切众生大愿夜神具足不可思议光身。尔时善财发如是心，普于一切安住精进，趣一切智为所缘故，于善知识起自心想，得一刹那定同分等十种清净。复由圣母所放光明，即时获得诸佛刹土极微尘数诸大菩萨同分妙智，次以颂音赞扬圣母，赞已请问。为得菩萨成熟众生，如其意乐令种善根解脱，如实正闻开示法要。

第四十事品：序说善财童子诣岚毗尼林，见妙德圆满爱敬林神，住于林中大宝树下庄严圆满宝楼阁中，坐摩尼藏狮子之座，二十亿那由他诸林神女前后围绕，宣说一切菩萨示现受生大海法数。礼请如前。为得菩萨无量劫中，神通游戏自在受生解脱，如实正闻开示法要。

第四十一事品：序说善财童子诣迦毗罗城菩萨集会普现法界影像光明宫殿。其中有一主宫殿神，名无忧德，与一万主宫殿神咸来相迎，供养赞叹善财童子，互相开演微妙法音，随逐善财入普现法界影像光明宫殿。尔时善财见释女瞿波在诸菩萨大集会中，坐于普现一切影像殿中，摩尼宝王大莲花藏狮子之座，八万四千婇女眷属之所围绕。礼请如前。为得观见一切菩萨三摩地海解脱境界，如实正闻开示法要。

第四十二事品：序说善财童子诣菩提场如来会中，欲往亲近摩耶夫人。正当思惟求善知识无量功德时，有主城神，名宝眼，无量城神眷属围绕，住虚空中，手持无量诸天宝华，散善财上，示以庄严心城等广大法门。复于尔时菩提场中，有神名莲华吉祥及妙华光明，无量神众前后围绕，从道场出，住虚空中，于善财前，广说圣母于须弥山微尘数等，百千恒河沙数等，诸世间界微尘数等，及诸刹海微尘数等一切劫中承事如来，现证解脱大海。时诸神众，各从耳中放吉祥光，以其种种大宝光明入善财顶，令其获得清净光明，除一切暗无翳垢等十种法眼。有守护法堂罗刹鬼王，名曰妙眼，与其眷属万罗刹俱，以天拘苏摩可爱妙华，及众妙香，散善财上，为说菩萨决定安住十种三摩地法。即时睹见大宝莲华，从地涌出，金刚为茎，摩尼为叶。于华藏上，有一楼阁，名普纳十方法界藏，种种珍奇以为严饰，中有如意宝王莲华之座。摩耶夫人安坐其上，无量功德所庄严身，随顺众生各自意乐，应机教化，现种种身。尔时善财亦随显现尔许化身，于一切处摩耶母前，恭敬礼拜，即时证得无量无数妙三摩地。为得菩萨广大愿智幻相庄严解脱，如实正闻开示法要。

第四十三事品：序说善财童子诣三十三天，谒具足正念王之女天王光，礼请如前。为得菩萨无碍念清净庄严解脱，如实正闻开示法要。

第四十四事品：序说善财童子诣迦毗罗城，谒遍友童子师，承其教示，获见善知众艺童子，礼请如前。为得菩萨善知众艺解脱，如实正闻开示法要。

第四十五事品：序说善财童子诣摩竭提国有义聚落，谒贤胜优婆夷，礼请如前。为得菩萨无住中围无碍静虑，如实听闻开示法要。

第四十六事品：序说善财童子渐次南行，诣沃田城，谒坚固解脱鬻金长者，礼请如前。为得菩萨无碍念清净庄严解脱，如实正闻开示法要。

第四十七事品：序说善财童子诣沃田城，谒妙月长者，礼请如前。为得菩萨净无垢智光明解脱，如实正闻开示法要。

第四十八事品：序说善财童子渐次南行，诣广大声城，谒无胜军长者，礼请如前。为得菩萨无尽相解脱，如实正闻开示法要。

第四十九事品：序说善财童子诣南方达磨聚落，谒最寂静婆罗门，礼请如前。为得菩萨真实权持之行，如实正闻开示法要。

第五十事品：序说善财童子渐次南行，诣妙意华门城，谒德生童子、有德童女，礼请如前。令得菩萨幻住解脱，说诸法幻，又广开示慈氏菩萨胜妙功德，一切菩萨修无量行修习方便，及诸依止善知识法，如实正闻开示法要。

第五十一事品：序说善财童子渐次南行，近海门处大庄严园中，有毗卢遮那庄严藏广大楼阁，住于无边法理趣海。尔时善财合掌瞻仰，恭敬顶礼，近楼阁前，目不暂瞬，以多句颂广为赞叹，一心渴仰弥勒菩萨无边功德，曲躬住立。乃见弥勒从楼阁外，别处而来，无量释、梵大众眷属前后围绕。善财见已，即前作礼。弥勒菩萨观察善财，指示大众叹其真实无量功德，以颂赞之。适于随顺教诲，方使慰谕之时，文殊师利神力所化种种华鬘，盈善财手，即时奉散供养弥勒菩萨之身。是时弥勒摩善财顶而说颂言：‘善哉，善哉！真佛子！普策诸根无懈倦；不久当成功德藏：犹如文殊及与我。’善财闻说，以颂还答，合掌恭敬祈请说法。

次由弥勒称赞善财种种功德，令众会中百千众生坚固无上菩提之心，广示善财种种差别，赞菩提心功德法门。既入毗卢遮那庄严藏大楼阁中，而为显现诸游戏相，示现弥勒于三世中所作事业，无量差别菩萨众会，从毗卢遮那庄严藏大楼阁，令见希有大解脱行无边法门，入于了知三世一切境界无失念庄严藏自在解脱威神大力，即便证得诸三摩地。然后为说菩萨解脱一切庄严，‘无去无来，如幻如影’。又为宣说一切菩萨十种生处，复以种种法门而广赞扬文殊菩萨一切功德，如是见闻开示法要。

第五十二事品：序说善财童子诣苏摩那城，思惟文殊师利菩萨，起深信心，住立门所。尔时文殊从一百一十由旬外，遥伸右手摩善财顶，赞叹慰谕，令其深入普贤行轮。

第五十三事品：序说善财童子由彼一切大善知识，次第开示海功德相，普令增长无边慧力。于彼圣者普贤菩萨现前生起胜恭敬时，便能睹见、将见普贤十种瑞相。于其觐见普贤时分，获得生起一切佛法光明无边慧力之眼，便见普贤在于毗卢遮那如来应正等觉前，坐莲华藏狮子之座，诸菩萨众所共围绕，一切毛孔示现三世刹海庄严种种色相，示现一切如来三世事业、一切法藏，如实睹见游戏庄严。如于毗卢遮那如来前示现如是不可思议游戏神通，十方一切如来之前，亦复如是游戏示现。十方刹海一一尘中，普遍充满解脱法界，广大虚空，现前观见。尔时善财获得十种清净智波罗蜜多行，既得是已，普贤菩萨伸其右手摩善财顶，令其证得深入一切佛刹极微尘数三摩地门，而得观见不可思议大解脱相。又为宣说一切众生但闻其名得不退转最胜功德一切法门。当是之时，善财童子获得能入普贤菩萨游戏通智，与普贤等，乃为说此贤行愿王。上来略述华严经义，亦即广说此贤行愿甚奇希有缘起理趣。

乙二、梵土诸疏所释理趣有二：
（丙一、略述陈那菩萨所造贤行疏义。丙二、略述释迦知识所造疏义。）

丙一、略述陈那菩萨所造贤行疏义，有十：（丁一、敬礼。丁二、供养。丁三、悔罪。丁四、随喜福善。丁五、劝转法轮。丁六、请佛住世。丁七、回向善根。丁八、愿差别。丁九、愿究竟。丁十、愿胜利。）

丁丁敬礼有四：（戊一、三门合礼。戊二、身礼。戊三、意礼。戊四、语礼。）

戊一、三门合礼

第一至第四句。

戊二、身礼

第五句至第八句。

戊三、意礼

第九句至第十二句。

戊四、语礼

第十三句至第十六句。

丁二、供养有二：（戊一、有上供。戊二、无上供。）

戊一、有上供

第十七句至第二十四句。

戊二、无上供

第二十五句至第二十八句。

丁三、悔罪

第二十九句至第三十二句。

丁四、随喜福善

第三十三句至第三十六句。

丁五、劝转法轮

第三十七句至第四十句。

丁六、请佛住世

第四十一句至第四十四句。

丁七、回向善根

第四十五句至第四十八句。

丁八、愿差别、有十六种：（戊一、意乐清净。戊二、不忘菩提心。戊三、不染加行。戊四、利益有情。戊五、被服铠甲。戊六、会遇同分菩萨。戊七、令善知识欢悦。戊八、如来现前。戊九、摄持正法。戊十、得无尽藏。戊十一、趣入。戊十二、力。戊十三、修习对治。戊十四、菩萨作乐。戊十五、随学回向。戊十六、总结事义。）

戊一、意乐清净，有三：（己一、如来意趣圆满意乐。己二、净治佛土意乐。己三、利益安乐有情意乐。）

己一、如来意趣圆满意乐

第四十九句至第五十二句。

己二、净治佛土意乐

第五十三句至第五十六句。

己三、利益安乐有情意乐

第五十七句至第六十句。

戊二、不忘菩提心、有六：（己一、忆念本生。己二、出家。己三、不毁犯戒。己四、随各别有情言音而为说法。己五、相续调柔、勤修六度。己六、断除罪障。）

己一、忆念本生

第六十一句至第六十二句。

己二、出家

第六十三句至第六十四句。

此中忆念本生，及常出家，为不忘菩提心第一因。

己三、不毁犯戒

第六十五句至第六十八句。

此为不忘菩提心第二因。

己四、随各别有情言音而为说法

第六十九句至第七十二句。

此为不忘菩提心第三因。

己五、相续调柔、勤修六度

第七十三句至第七十四句。

此为不忘菩提心第四因。已上三颂有半，名为成就菩提心顺缘能治品愿。

己六、断除罪障

第七十五句至第七十六句。

此为断除发菩提心所治品愿。

戊三、不染加行

第七十七句至第八十句。

戊四、利益有情

第八十一句至第八十四句。

戊五、被服铠甲

第八十五句至第八十八句。

为满佛法，为令随顺诸有情行，为施正法，于彼未来一切劫中，被服铠甲，行无厌倦。

戊六、会遇同分菩萨

第八十九句至第九十二句。

此为会遇大乘道中贤善助伴，同学大乘道愿。

戊七、令善知识欢悦

第九十三句至第九十六句。

此为会遇大乘善知识已，意乐加行，如理依止愿。

戊八、如来现前

第九十七句至第一百句。

亲面参觐胜化身已，令欢悦愿。

戊九、摄持正法

第一百零一句至第一百零四句。

初句：谓自摄持大乘正法。其第二句：谓是为他开示教法。其第三句：谓是住持增长证法。其第四句：谓于上说三事，一切时中，能正行愿。

戊十、得无尽藏

第一百零五句至第一百零八句。

戊十一、趣入，有八：（己一、趣入观见一微尘上，即是十方尘数清净器情所住刹土。己二、趣入一切十方刹中，亦如是见。己三、趣入佛语。己四、趣入如来转正法轮。己五、趣入诸劫趣入。己六、趣入观见如来，及诸如来所行境界。己七、趣入成立佛土。己八、趣入亲诣如来面前。）

己一、趣入观见一微尘上，即是十方尘数清净器情所住刹土

第一百零九句至第一百一十二句。

己二、趣入一切十方刹中，亦如是见

第一百一十三句至第一百一十六句。

己三、趣入佛语

第一百一十七句至第一百二十句。

如来一言，成为各别趣中能解音声，于诸音声，听闻不乱愿。

己四、趣入如来转正法轮

第一百二十一句至第一百二十四句。

于佛所转一切法轮，顿时俱能通达义愿。

己五、趣入诸劫趣入

第一百二十五句至第一百二十八句。

趣入三世诸劫如来身语行境。此名以智一刹那顷能趣入愿。

己六、趣入观见如来，及诸如来所行境界

第一百二十九句至第一百三十二句。

一刹那顷，观见三世一切如来，于诸如来所行之道，一切所作，以如幻定之力能趣入愿。

己七、趣入成立佛土

第一百三十三句至第一百三十六句。

此为成立当来自所庄严佛土愿，名为获得修净土时殊胜功德。

己八、趣入亲诣如来面前

第一百三十七句至第一百四十句。

尽未来际一切劫中，一切如来，于一切方，现证菩提，转正法轮，示涅槃相，三种所表，十二所作，诸大师前。自能化现如海之身，作供养等诸敬事愿。

戊十二、力

第一百四十一句至第一百四十八句。

即以慧力、方便力、三摩地力、各别其数，成为十力。

戊十三、修习对治

第一百四十九句至第一百五十二句。

业力、烦恼力、魔力，此三种力，依对治品根本损伏愿。

戊十四、菩萨作业

第一百五十三句至第一百六十句。

具足力能，成就佛法善根；具足力能，成熟有情；具足力能，净修佛土。是名于此八如海处能修学愿。

戊十五、随学回向，有二：（己一、随学如来。己二、随学菩萨。）

己一、随学如来

第一百六十一句至第一百六十四句。

己二、随学菩萨

第一百六十五句至第一百七十六句。

与彼普贤、文殊二大菩萨同等修学胜方便度、胜般若度圆满行愿。

戊十六、总结事义

第一百七十七句至第一百八十句。

上来已明十六种竟。

丁九、愿究竟

第一百八十一句至第一百八十四句。

此愿究竟，能获大果。谓证正等正觉位已，乃至虚空常住中间，作有情事。

丁十、愿胜利，有二：（戊一、现法胜利。戊二、后生胜利。）

戊一、现法胜利有四：（己一、摄受殊胜福德。己二、远离恶趣恶友，亲见如来。己三、善得应得，获与一切菩萨同分。己四、永尽业障。）

己一、摄受殊胜福德

第一百八十五句至第一百九十二句。

己二、远离恶趣恶友、亲见如来

第一百九十三句至第一百九十六句。

己三、善得应得，获与一切菩萨同分

第一百九十七句至第二百句。

己四、永尽业障

第二百零一句至第二百零四句。

戊二、后生胜利，有二：（己一、因所摄。  己二、果所摄。）

己一、因所摄

第二百零五句至二百零八句。

己二、果所摄

第二百零九句至第二百一十二句。

自此以后，从第二百一十三句起，至第二百四十句止，有七颂文，十大科判所未摄释。以要言之，一一文句，皆得释为总结胜利：谓得世、出世一切圆满；发贤行愿善根回向；断除诸障，摄受殊胜清净依身；获得记别，成办有情一切义利。

一、得世、出世一切圆满

第二百一十三句至第二百一十六句。

二、发贤行愿善根回向，有二：（一、随学菩萨回向。二、随学如来回向。）

一、随学菩萨回向

第二百一十七句至第二百二十句。

二、随学如来回向

第二百二十一句至第二百二十四句。

三、断除诸障，摄受殊胜清净依身

第二百二十五句至第二百三十二句。

四、获得记别，成办有情一切义利

第二百三十三句至第二百四十句。

所余第二百四十一句至第二百五十二句三颂，释文不现。

上来略述陈那疏义，此与龙猛所造会疏、总义（纲领）、分释（节目）多分相同。

丙二、略述释迦知识所造疏义，此疏总标六门：

（丁一、愿前方便。丁二、胜解行地愿。丁三、增上意乐清净地愿。丁四、果。丁五、愿胜利。丁六、暂一诵持愿文善根，回向胜利。）

丁一、愿前方便

有十二颂：即第一句至第四十八句。

释文谓于十二颂后，接诵‘普随一切如来学，善能开演其贤行；善能清净其智行，毕竟圆满菩提行。’四句颂文，便能总摄一切愿义。

丁二、胜解行地愿

有十五颂：即第四十九句至第一百零八句。

丁三、增上意乐清净地愿。丁四、果

有十九颂：即第一百零九句至第一百八十四句。

［此合初地极喜地，至第十一地普光地而说。］

丁五、愿胜利

有八颂：即第一百八十五句至第二百一十六句。

丁六、暂一诵持愿文善根，回向胜利

有六颂：即第二百一十七句至第二百四十句。

所余二颂，彼疏释为亦名回向。又彼疏中，门类总义，与前二疏，多分相同。庄严贤师所疏总义，与前二疏亦同。

上来俱是梵土诸疏所说理趣，藏土亦有数种疏释，唯从上引诸疏所说，删易字句，不现余文。至尊达喇那答及遍知力炽炎光二师所译，虽略广大，前者多专约上地说，有多释法，不合余论。后者多分沿袭释迦知识疏义，而以经文分诸章节，强与十地及十度合，亦与一切清净大论释法难通；尤以所说和合十地一切道次，当知唯能略等其相，难如实合。今于彼等，亦不意乐广破广立，唯由显说自内宗法，而令了知诸余建立。

乙三、正释经义，有四：（丙一、成就愿因，积集净治修学次第（7）。

丙二、正修菩萨愿之次第。丙三、作意思惟此愿胜利。丙四、诵持文等一切胜利。）

丙一、成就愿因，积集净治修习次第，有七：

修此愿者，应依金洲大师、阿底峡尊者所订仪轨，谓当净除所住宅舍，设身、语、意三种所依（8）。端严陈设，以无谄曲随力所备诸种供物，如理威仪，住安稳座。先当起修观缘无常、诸恶趣苦、生死过等，及缘有情观修慈、悲、喜、舍四种无量，调练心已。次修归依及发心等，决定令与相续和合。若瑜伽人其根慧利，即于此时，应以十方无边刹中现住诸佛、诸菩萨众，于其净土庄严之中，各自安住所住本处为所缘境。诸初业者无此力能，为于所缘易显现故，依止菩提道次第所说教授，令其观想资粮田等，起猛信乐所归依处，于自周围所住有情，励力生起慈心、悲心，即由此中起修七支。此七支者，名为修习积集资粮、净治罪障。

（丁一、敬礼支。丁二、供养支。丁三、悔罪支。丁四、随喜支。丁五、劝转法轮支。丁六、请不涅槃支。丁七、回向支。）

丁一、敬礼支，有四：戊一、三门合礼。戊二、身礼。戊三、意礼。戊四、语礼。）

戊一、三门合礼（第一至第四句）

所有十方世界中，  游于三世人师子，
我以清净身语意，  遍礼一切悉无余。

此非唯以一方世界（9），或一时分佛为所缘（10）。谓于所有一切住于十方，过去世中已兴于世、未来世中当兴于世、现在世中出兴于世，人中师子（11）诸佛如来为所缘已。非是随逐世间而转，依于至诚，以‘清净身语意’（12）三门恭敬作礼。又礼一佛，尚能获得无量福德！况复缘礼尔许诸佛。

戊二、身礼（第五至第八句）

以彼贤行为愿力，  一切如来意现前，
一身复现刹尘身，  一一遍礼刹尘佛。

‘彼贤行’者，谓归依处一切贤行。言‘贤行’者，谓其功德。于彼功德引起信力，所有‘愿力’以为等起（13），普于一切方时（14）所摄诸佛如来，‘意’缘其境如‘现’在‘前’（15），为作礼时，化现自身与诸刹土微尘数等，五轮据地（16），清净顶礼。又一身礼（17）尚能感得广大福德，况复能以尔许身礼，得福尤大。

戊三、意礼（第九至第十二句）

于一尘中尘数佛，  各住菩萨众会中，
无尽法界亦复然，  我信诸佛皆充满。

谓于一一极微尘中，有与一切尘数同等诸佛，各自安住菩萨眷属围绕中间。如是相状，为从与彼法界真性（18）平等安住如来心中，无二智所游戏示现，尽虚空界无不周遍。故我深信，一切法界亦皆充满如是之身及庄严刹，由是因缘，信受不可思议功德（19）。

戊四、语礼（第十三至第十六句）

诸功德海赞无尽，  普以音支大海声，
称扬一切佛功德，  我今赞叹诸善逝。

诸归依处一切功德，有如大海。赞美无尽音‘支’，谓因；能造音者（20），即舌颚等。化出众多舌颚等已，出和顺声，普于诸佛称扬一切无边功德。‘我今赞叹一切善逝’（21）：此于音支，释舌颚等，是依至尊大自性说；释迦知识疏中亦如是说。余疏有谓是音功德（22）。

丁二、供养支，有二：（戊一、有上供、戊二、无上供。）

戊一、有上供（23）（第十七至第二十四句）

以诸妙华妙华鬘，  伎乐涂香胜伞盖，
最胜灯明妙烧香，  我悉供养诸如来。
诸妙衣服最胜香，  末香积等妙高峰，
一切最胜庄严具，  我悉供养诸如来。

‘华、华鬘、伎乐、涂香、伞盖、灯明、烧香、衣服、胜香’，如是诸名易解不释。言‘妙’、言‘胜’者：谓花为首，一一皆是人天处中，所有颜色、形相、香味、庄严、无边丰足，众多种类不可思议，如是妙胜，供献如来。言‘末香积等妙高峰’者：谓以妙香为末，可散可烧，即以此末积为包等，或与绘造中围（24），粉色和合，次第高广，有如妙高峰状（25）。言‘一切最胜庄严具’者：谓花为例，一一皆是种种庄严，如以纯一花质所编。若伞盖、若幢幡、若幰帐、若无量宫、若宝座、若彩繸等种种形状及放光等，化为众多，即以如是一切最胜庄严具而作供养。如是于花，所余鬘等如应而合（26）。

戊二、无上供（27）（第二十五至第二十八句）

所有无上广大供，  我悉胜解诸如来，
深心信受贤行力，  顶礼供养诸如来。

若诸菩萨具足神境（28）及三摩地（29）广大威力，随有所供，皆成‘无上’。谓能化现（30）众多胜妙，世间所无一切什物故。有如贤瓶、随欲妙树、如意摩尼等，暂一思惟，便有无边承事什物，又兴无边正法音声、赞叹音声，普遍充满一切佛刹，故名‘广大’。如是，自亦化尔许身而作供养。言‘深心信受贤行力’者，谓等起殊胜，于彼一切应供养境，励力生起深恭敬心，发清净信，复求现证彼等上位，发深欲信（31）以为等起，然后为作顶礼、供养（32）（33）。

丁三、悔罪支（第二十九至第三十二句）

我由贪嗔痴增上，  从身语意之所起，
诸所造作恶不善，  一切我今别别悔。

贪嗔痴三增上力故，以为其因，身语意三为其所依，诸恶不善为其自性，所作制罪、性罪之相，［参看戒品纂释］或由自作，或教他作，见作随喜，所有一切应悔除法。谓怖异熟（34），起悔愧心（第一力），护当来心（第二力），信归依境有从恶果济拔力能（第三力），通达罪恶三轮（35）无性（第四力），由彼四力圆满无阙，别别悔除（36）（37）。

丁四、随喜支（第三十三至第三十六句）

十方一切佛菩萨，  独觉有学及无学，
一切趣中诸有情，  所有福善我随喜。

十方所住诸佛如来、诸菩萨众，一切独觉（38），有学、无学诸声闻众，及诸异生（39）。如是五者，于其一切福善聚积，（我）有如贫儿获得宝藏，以至诚心，薰修随顺，欢喜忻乐（40）。

丁五、劝转法轮支（第三十七至第四十句）

十方所有世间灯，  现证菩提得无滞，
我今劝请诸世尊，  转于无上妙法轮。

十方刹中诸佛世尊，照灭世间一切衰败，故号为‘灯’。彼诸世尊现等正觉（41），获得无滞无碍智已（42），经时不久，于彼一切化尔许身，劝转深广无上法轮（43）。

丁六、请不涅槃支（第四十一至第四十四句）

诸佛若欲示涅槃，  我悉合掌而劝请，
利乐一切有情故，  唯愿久住刹尘劫。

十方刹中（诸佛）若有欲示涅槃相者，（我悉）化无量身合掌劝请。普为生起一切有情未来利益、现前安乐故（44），唯愿安住等诸刹土微尘数劫，（请）不般涅槃（45）。

丁七、回向支（第四十五至第四十八句）

敬礼供养悔露罪，  随喜劝转请常住，
尽我所积少善根，  一切回向大菩提。

上来所说‘敬礼’六支，诸善为首一切善根（46），共诸有情，以猛乐欲，回向圆满大菩提因（47）。

又诸罪障，为能障碍如实成就；后说诸愿，此能净治。一切福善，为能如实成就诸愿顺缘，此展转增，永无穷尽，定应此为成就愿因。如是七支能成三事：谓净罪障、积福资粮、增长善根令无穷尽。若能以此为前行事，便能成就后说诸愿，故极切要（48）。

丙二、正修菩萨愿之次第，有三：（丁一、修习胜解行地愿之次第。丁二、修习圣者菩萨地愿之次第。丁三、感得愿果之量。）

初复有十：（戊一、修治意乐清净。戊二、不忘菩提心之道。戊三、不染加行。戊四、利益有情。戊五、被服铠甲。戊六、会遇同分菩萨。戊七、令善知识欢悦。戊八、一切如来，皆现在前。戊九、摄持正法。戊十、得无尽藏。）

戊一、修治意乐清净，有三：（己一、修治供养如来，及令如来意趣圆满意乐。己二、修治佛土意乐。己三、修治一切有情安乐增上意乐。）

己一、修治供养如来，及令如来意趣圆满意乐（49）
（第四十九至第五十二句）

供养过去一切佛，  现住十方世界佛，
未来意乐速圆满，  依次现证佛菩提。

谓以敬礼等善根为首，乃至自身、资财、三世善根，供献往昔过去已兴世佛、现住十方世界诸佛。于诸佛前，思惟兴起普贤供云令其欢悦，恒时供养，如是发愿。言‘未来’者，谓诸趣入三乘道中，于未来世，当得成佛。

（如后文十地经论第二大愿中所说，三佛菩提。）

既供献已，得令彼等成佛顺缘，圆满无阙。所言‘意乐’者，谓其意趣。毕竟圆满彼意趣已，依次得到佛地究竟。如是发愿，是名于彼趣入道中有学、无学施舍善根之法。其余生中，亦能如是施舍之愿，当知如后所说诸愿。

己二、修治佛土意乐（第五十三至第五十六句）

所有十方诸刹土，  愿皆广大极清净，
于中菩提树王下，  诸佛佛子咸充满。

此亦如前，能以自身、资财，及诸善根，施舍十方诸器世间，愿诸刹土所有砾石、荆棘、砖瓦、株杌、残椿、及谷坑等一切过失，令其清净。大地成为摩尼自性，诸随欲树以为林苑，八功德海，七宝为山，无量宫殿，摩尼座等，尊贵丰足，有如极乐庄严净土。于其中间菩提树王之下，有诸如来及诸佛子一切菩萨之所充满，此以施舍器世间法为其主要。

己三、修治一切有情安乐增上意乐（第五十七至第六十句）

十方所有诸有情，  愿无疾病常安乐，
众生法利悉顺成，  所有意望亦成满。

此亦如前，能以自身及资财等，施舍十方世界六趣所摄尽其所有诸有情已，愿令彼等无有疾病。言‘无疾病’者：谓如契经多处所显，或云疾病、或云愁忧、或云恼坏，皆是总标生死之苦及彼苦因、业与烦恼。故今愿令离生死苦及其因已，身心成就圆满安乐；复愿众生成办所求合法义利，一切顺缘如意成就；又愿众生当来获得佛位意望亦能成满。此以施舍有情趣入多种道法（50）为其主要。又此亦是修治慈所缘（常安乐）、修治悲所缘（离忧苦）、修治希求利他意乐方便（51）。（第三句、第四句）。

戊二、不忘菩提心之道，有五：（己一、忆念本生，常得出家。己二、不毁坏戒。己三、随各别有情言音而为说法。己四、相续调柔、勤修六度。己五、断除罪障。）

己一、忆念本生，常得出家（第六十一至第六十四句）

我为修行菩提行，  一切趣中念本生，
诸余生中受生死，  愿我常得趣出家。

若如上说，为令成办他有情利，自应证得正等觉位。此最胜因：由我修行发菩提心，增长菩提心所有贤行。为修行故，人天等趣，在在所生，尔时获得如念宿住（52），能念一切转受余生（53）。以此力故，一切生中，展转领受诸生死时（从生至死，于其中间），忆念处在居家过患、出家胜利，恒趣出家。是谓有如不动苾刍，发如是心：我行一切菩萨行时，乃至尚未成正等觉，唯一求得苾刍（即比丘）依身。此中主要，乃至未得大地中间（未登地前），多分能由在家过失障菩提心，故其中间一切余生，愿常出家，此为不忘菩提心第一因。

己二、不毁坏戒（第六十五至第六十八句）

我随一切如来学，  毕竟圆满其贤行，
戒行清净无污垢，  恒不毁犯无过行。

一切余生受持愿心，及趣入心（54）。

初谓随学三世一切如来，后谓毕竟圆满普贤之行，此所依者，谓三种戒（55）。

思惟自利而不毁犯不染、有染诸罪过失，而行正行如是菩提趣入律仪清净愿者，为不忘菩提心第二因。

己三、随各别有情言音而为说法（第六十九至第七十二句）

天语龙语药叉语，  鸠槃荼语及人语，
所有诸趣一切语，  我以诸音为说法。

谓以天、龙、药叉（56）、鸠槃荼（57）、人等各别趣中，各自语言为说法愿；又复于自所生趣中，以其语言而为说法。如受一种人天依身，复以各别国土，各别种姓，诸种言音为其说法。言‘说法’者，谓说大乘法。以要言之，愿善显扬大乘法者，为不忘菩提心第三因。

己四、相续调柔、勤修六度（第七十三至第七十四句）

淳善精勤修诸度，  恒不忘失菩提心。

言‘淳善’者：谓相续调柔，此即安住种性功德愿。当知大乘种性虽有多说，然如经言，要以上品慈愍为性，相续调柔。言‘精勤修诸度’者：谓六度行，未知今知，已知不坏，复令展转向上增长，名精勤修。以要言之，愿常安住大乘种性修学其行，为不忘菩提心第四因。自此已上三颂有半，名为成就发菩提心顺缘能治品愿（58）。

己五、断除罪障（第七十五至第七十六句）

所有诸罪能为障，  愿皆清净悉无余。

所言‘罪’者：谓四黑法等诸陨坠罪。所言‘障’者：谓谤大乘等（59）诸种业障，邪见、我慢等诸烦恼障。以要言之，愿勤清净障碍生起大乘正道一切罪障，名为断除发菩提心所治品愿（60）。

戊三、不染加行（第七十七至第八十句）

业与烦恼诸魔事，  世间趣中得解脱，
犹如莲华不著水，  日月经行不滞空。

谓如有漏善与不善诸不动‘业’（61），爱、取、有等诸种‘烦恼’，贪著爱味五妙欲味（62），或复由他能作障碍利益自法诸种‘魔事’（63）。

如是三事，受生流转为牵引因，（如何于）诸世界中，随生何趣亦能解脱此三过患：一者、令此三过无有气力堪能障道。二者、非唯令此三过不能障道，便自喜足。愍有情事，愿增上力数数受生，于生死中，不希酬报（64）。

前者有如莲从水生，而不著水，名为不染；后者有如日月除世间暗，无有厌倦，经行虚空，不滞虚空。

胜解行位，虽无力能断三过根，然应受生于生死时，令其不堪能障碍道，此亦小乘圣者所能，不应喜足。故于此中，又复应有为利他故，受生生死无厌倦愿。

戊四、利益有情（第八十一至第八十四句）

尽刹土量诸方所，  息灭恶趣一切苦，
善能安处有情乐，  一切趣中行利益。

谓尽所有虚空尽际，刹土量中，岂唯一方？所有十方一切有情，以恶趣苦（65）而为上首。一切生死之苦亦令息灭。复善安处一切有情具足人天增上生乐，非唯尔所便自喜足，一切趣中各随所应，各依所宜，方便引入于大菩提，成就有情究竟利益。此与上文（即第五十七至第六十句）所说略异。前者，唯是现在信乐诸余生中如是行愿，此一颂文义虽如前，然由慈愍与愿增上力故，故思受生众多趣中，成办有情诸义利愿。又此亦是胜解行位，与诸已登大地菩萨得生自在，于世界中示现种种生死不同。

戊五、被服铠甲（第八十五至第八十八句）

毕竟圆满菩提行，  趣入随顺有情行，
极善开演其贤行，  尽未来劫普修行。

为令证得无上菩提，自内圆满二资粮（66）行。‘随顺一切有情’根行（67）、界行（68）、及随眠行（69）而开发之，令诸有情趣入大乘。‘极善开演’：表普贤行一切理趣大乘正法。如是三行，于尽未来一切劫中，无有厌倦而普修行，是即名为‘被服铠甲’。

又此经文多次显现，若菩提行，若贤行，所训释义众多不同。要随各自所在分位，别释其义，此亦依据梵土智者所造释论，当知此中训释经文，与此相同尚有多处（70）。

戊六、会遇同分菩萨（第八十九至第九十二句）

所有与我等行行，  愿得常与彼共住，
身业口业及意业，  同行同愿而修行。

与我修行菩提之行，同分等行一切菩萨，乃至证得上位中间，一切生中常与会遇。既会遇已，身口意业至极清净，互友互助，欢悦亲附，以大殷勤同普贤行，或复同愿而正修行，是名会遇修大乘道胜助伴愿。

戊七、令善知识欢悦（第九十三至第九十六句）

所有益我善知识，  为我显示其贤行，
我愿常与彼会遇，  于彼从不拂其心。

言‘益我善知识’者，谓依悲愍，以无染心（71）为我显示大乘正道诸善知识，彼善知识为我开示、讲演、教授普贤行法，乃至未证菩提中间，我常得与彼等会遇。既会遇已，从不暂一拂逆其心，亦不暂发不悦意语，专一成办意乐加行，令其欢悦。此中专明永不离失如理依止大乘功德胜善知识，义至切要。

戊八、一切如来皆现在前（第九十七至第一百句）

佛子所绕诸世尊，  我常现前亲面对，
尽未来劫无厌倦，  皆为兴起广大供。

谓菩萨众所绕世尊，即十方佛最胜化身。我由净眼（72），于彼一切能为现前所行境界，以清净心瞩见诸佛土。言‘尽未来劫’等者，谓于一切，乃至当诣菩提道场诸佛世尊，我无厌倦，发勤精进现前供养（73）。

又复能以陀罗尼力、三摩地力、及神境力，兴起广大不现前供，令其欢悦。如前所明二颂文义：初为显示如理依止演大乘道诸善知识，其等流果得法流定（74）；次为显示亲面参觐最胜化身，便能获得受教授等，故极切要。

戊九、摄持正法（第一○一至第一○四句）

摄持一切佛正法，  普能光显菩提行，
极善净治其贤行，  尽未来劫常修行。

谓于佛说十二分教（75）所有法蕴、（76）文句义理，获得不忘陀罗尼门（77），悉能摄持。于其无上菩提行中大乘教法（78），普能为他光显开示。普贤行中大乘证法（79），自他相续皆能长养，极善净治彼违逆品，令其清净。尽于未来一切劫中，修行无厌。陈那释云：‘此文初句：谓自摄持正法文义。其第二句：谓是为他开示教法。其第三句：谓于相续长养证法，而正加行。’

此密意说：资粮道位（80），获得法陀罗尼、义陀罗尼、忍陀罗尼、咒陀罗尼已，总持不忘诸法文义，便有摄持佛法力能（81）。

戊十、得无尽藏（第一○五至第一○八句）

亦能流转诸有中，  所获福智皆无尽，
方便胜慧定解脱，  成诸功德无尽藏。

谓于一切欲有、色有、无色有中，（82）流转（83）受生，亦能获得福智资粮，无边无尽。又于种种教化有情方便（84）、种种悟入真性胜慧、种种功德所引发定、种种如幻解脱，巧练磨已，当证无边一切功德无尽宝藏。此中密意，谓于初一无数大劫，至加行道世第一法（85）资粮圆满。数数能于无余大乘正道行相，巧练磨已，自在纯熟，自内无间，从此证得大乘见道（86），毕竟获得当证真性现观狮子奋迅等三摩地（87），不可思议神境之门所有功能。

于此经文，从第四十九句‘供养过去一切佛’起，至此颂止，释迦知识释为与胜解行地修行六种波罗蜜多相合。现观庄严论中所说缘佛等净信诸句，摄集大乘胜资粮道，合为五法，与此亦合（88）。

圣者龙猛父子（89）亦云：‘大悲、菩提心、通达真实性智，是胜解行地所修三种。’圣者无著于菩萨地中云：“一者、于诸佛法深生净信。二者、观诸有情缘起道理，证得唯有纯大苦蕴，发起大悲。三者、观见彼已，自誓愿言：‘我当令彼诸有情类，解脱如是纯大苦蕴，得第一乐，发起大慈。’四者、为欲救拔一切忧苦，自无顾恋。无顾恋故，能舍内外一切身财，于诸有情而行惠施。五者、为欲利益诸有情故，从他勤求世出世法，曾无厌倦。六者、无厌倦故，证得一切论智清净，善知诸论。七者、善知论故，于劣、中、胜诸有情所，如应如宜而修正行，善解世间。八者、即于如是正加行中，依应时分量等正行而修惭愧。九者、即于如是正加行中，得无退转坚力持性。十者、以诸上妙利养恭敬及与正行，供养如来。是名：十种净修住法。由此能令极欢喜住，速得清净。所谓净信，慈，悲，惠舍，无有厌倦，善知诸论，善解世间，修习惭愧，坚力持性，供养如来。”

此胜解行地十种净修住法，与此亦合。至尊慈氏云：‘资粮、加行二种位中，亦应令其数数串习与下、中士所共道次。’

又从上说诸正论中，于其显示修大悲相，显示广释不染生死三过患等一切分法［业、烦恼、魔事三者，名三过患］。诸有智者当善观察，正了知已，便于经义授大决定。

丁二、修习圣者菩萨地愿之次第，有六：（戊一、趣入菩萨解脱。戊二、引发菩萨十力。戊三、修习对治。戊四、菩萨作业。戊五、随学。戊六、总结事。）

戊一、趣入菩萨解脱，有八：（己一、趣入观见一微尘中，即是十方尘数清净器情所住刹界。己二、趣入一切十方刹中，亦如是见。己三、趣入佛语。己四、趣入如来转正法轮。己五、趣入诸劫趣入。己六、趣入观见如来。己七、趣入引发佛土。己八、趣入亲诣如来面前。）

己一、趣入观见一微尘中，即是十方尘数清净器情所住刹界（90）。

一微尘中尘数刹，  一一刹有难思佛，
安住菩隆众会中，  行菩提行当观见。

谓于一微尘土（中），有与十方所有刹中微尘数等诸佛刹土；诸刹土中，复有不可思议诸佛安住菩萨众会围绕中间。我为证得无上菩提故，行菩提行皆当观见。

陈那云：‘难者或曰：佛刹一分尚不能显入于一尘。况复所有游于三世佛刹尘数一切佛刹，一一佛刹充满诸佛如来，一一如来住于菩萨大众中间，云何令于一微尘中，各别观见？答曰：“不也。”此如不可思议之业，尚能化出若上、若下种种物等，如是，由于不可思议智所化现，一微尘中何故不有？’圣言量中，亦说此是不可思议。智者于此无少惊异，如幻所变，何当执为极希奇事？如契经云：‘有四种不可思议事：一者静虑所起，二者龙，三者诸佛感力，四者世间导怙。’以是义故，于佛善说不应妄执，应当信受。譬如世间极褊小器，满盛清水，于中能现天空庄严、一切星等。

又如佛说：‘诸法如影像，如翳如梦相，如幻如阳焰，一切皆如是。’释迦知识云：‘何等时中许如是见？谓即所言：行菩提行。言行菩提行者，谓是修行菩萨之行。意谓令我圆满诸地，及与诸种波罗蜜多，故我为行菩提之行，当如是见。’问：于极微尘一尘之中，佛刹土数、佛及菩萨眷属众数，云何得有？谓诸世俗所依觉慧，于其微细极微尘中，而令观见无量无数诸佛刹土、诸佛如来、诸菩萨众，云何信受？答：此是一切僻执外义（91），未能通达大乘义中真实之义，不作串习熏修力故，当不信受。有暂了别，便能胜解，而勤熏修大乘义者，要以信受为其因力。此如梦中，见微褊舍住大象群，大众集会，广大稠林、龙及湖沼，种种罗列。如是众多无可算数，不应于中皆能同住。然亦尔时有彼可得，寝觉时中，复能明记。由此道理，诸静虑者，瑜伽自在，纯清净心所有境界，不可思议（92）。云何当有不信受事，经论于此已广抉择。又此亦是世间所能睹者，譬如幻师，从击鼓中，起一切物，现大种等。设有问言：是则此中唯述幻耶？答：‘此如颂云：诸和合所为，如星翳灯幻，露泡梦电云，应作如是观。’（此奘译文；罗什则云：一切有为法，如梦幻泡影，如露亦如电，应作如是观。）

是故，此为一切智者依于道理，依于圣教所应修习，于此不应生起疑惑。

己二、趣入一切十方刹中，亦如是见（第一一三至第一一六句）

如是无余一切方，  一毛端许三世量，
佛海及诸刹土海，  劫海修行善趣入。

谓如顷间所说之相，无余一切世界、一切方中，（一）毛发端许极微土量（中），尽其所有过去、未来、现在三世之量，所有诸佛庄严身海、庄严刹海，亦复如是皆能观见。乃至经历劫海中间，我为修行菩提之行，心无厌倦，趣入观见。

［此颂第四句，末后三字，正译应云：善趣入］

此二颂文所示净土及观见相，与前所说佛子所绕诸世尊等文，所明不同。彼处专说异生菩萨观见胜化身土及庄严身相，此则专说圣者菩萨观见受用圆满身（93）及庄严土相，有大差别。藏土一类疏中有谓，此中专说加行净土建立。然十地经密意说：言初地能见众多受用身土，又复一一刹那，频频观见广大土等。龙猛父子亦如是说，故应释为与初地合。然所见境，虽是同一受用身土，而由多种能观见者圣者菩萨，其观见时，所证高下有殊异故，所观见相种种不同，当知此中非似度量能明境界（94）。

己三、入佛语（第一一七至第一二○句）

一语音支大海声，  一切如来净音支，
普随诸趣如意音，  常得趣入于佛语。

佛受用身，虽一语言，亦能具足六十支等（95）如海音声；眷属中围所有有情，各自种类，各自意乐（96），及各自界（97），于彼一切以其各自言音相状而令趣入。谓诸佛语清‘净音支’，成就各自了解言音，决除疑惑，一切功德‘普随诸趣’，如其意乐所希求果而令趣入。即于如是如来语言，我以净信趣入听闻。

此受用身语密之相，谓受用身言音一分，能（成）为无边有情各自了解音声，如其语密，如实听闻。此有二种：一、由圣者菩萨自力能闻。二、由如来加持能闻。不应专合九地而说（98）。

己四、趣入如来转正法轮、（第一二一至第一二四句）

游于三世一切佛，  法轮理趣恒常转，
于诸所转无尽音，  以觉慧力我趣入。

‘游于三世一切’大觉世尊，恒常无间转于深广‘法轮理趣’。于其所转无边无尽言音义理，‘以觉慧力’，谓以广大智（99）力，善通达义，而正‘趣人’。前一颂文，唯是听闻不可思议言说音声；此谓应于所转法轮诸殊胜义，以纯净智而能通达，有大差别。又于何境何趣，为其开演何等言音，何等义理，如其所应令断疑惑。以纯净心，刹那刹那皆能通达。是即上地分位功德（100）。

己五、趣入诸劫趣入（第一二五至第一二八句）

趣入未来一切劫，  一刹那顷我趣入，
所有三世诸劫量，  依刹那分而趣入。

谓于‘未来一切劫’中，所有如来身、语广大事业出兴于世，皆能趣入。然亦此中，以心摄为‘一刹那（101）顷’而能‘趣人’。如是所有三世一切劫量，亦如以心摄刹那分，由正智力而善趣入，是名：已得自在加持刹那以为一劫，加持一劫为刹那等诸大菩萨解脱之相。又此所明趣入境者，应是专说如来事业（102）。

自此已上五种颂文，初、二身密，第三语密，第四意密。于佛意密，虽尚未能如实通达，然亦依止法轮义理而能证知。此第五颂，谓依时分，于彼趣入如来事业方便，以正智力而能趣入。

己六、趣入观见如来（第一二九句至第一三二句）

一刹那顷我观见，  游于三世人师子，
恒于彼等所行境，  幻解脱力能趣入。

自心刹那，同时‘观见’‘游于三世’诸‘人师子’，谓能观见海会围绕诸佛如来庄严之身。言‘恒于彼等所行境’等者：谓由诸佛静虑神变广大加持，如幻游戏所兴事业，我以现证‘幻解脱力’，而‘能趣人’。此谓趣入如来难思事业，已于神境及三摩地证得自在诸大菩萨趣入之相（103）。

己七、趣入引发佛土（第一三三至第一三六句）

一微尘中能引发，  所有三世庄严土，
如是无余一切方，  趣入庄严诸佛土。

以神境力、三摩地力，‘一微尘中’，亦‘能引发’所有三世所住如海刹土庄严。复依是相，趣入‘无余一切方’所，引发庄严无量佛土。

［此颂后二句，即十地经第七大愿］

上文所说‘于一尘中尘数佛’等句，谓是观见所余诸佛所庄严土；此则自以神境威力、三摩地力成庄严土，有大差别。菩萨应得八地已后，方能真实修习净土；然亦现前作意信解，从初地始，令其练磨修三摩地殊胜方便（104）。

己八、趣入亲诣如来面前（第一三七至第一四○句）

所有未来世间灯，  次第成佛转法轮，
示现涅槃究竟寂，  诸世尊前我往诣。

谓于后时，尽未来际，世间明灯诸佛如来所有无边十方世界存养安住。彼等或于同时，或复各别如其‘次第’，若有示现‘成佛’之相，若有示现转正法轮，若有示现究竟寂灭涅槃事业，此三为首，无边土中示现无边十二所作（即十二相成道）（105）。一切世尊，我于其前，以神境力，顿时化现尔许数身，所应顶礼、所应敬事、所应供养如海供云、所应劝请转法轮等，我俱往诣而作供养及承侍事。如是引发供养承事如来无量大愿，有如普贤菩萨从解脱中所兴供养及与承事（106）。

戊二、引发菩萨十力（第一四一至第一四八句）

普遍速疾神境力，  普门趣入法乘力，
普遍修行功德力，  普能遍满大慈力。
普遍贤善福德力，  无有滞碍大智力，
般若方便静虑力，  大菩提力皆引发。

第一力者：道中趣进，七地已后，至极速疾，刹那刹那依于神境，于诸佛土作供养等速疾能达，安立有情成熟解脱力至速疾，是名‘普遍速疾神境力’。

第二力者：非唯三乘为所共许，于其所有无量世界无边有情，随种种界，随种种根，种种意乐，以其所有如海种种诸乘，从一切门令诸有情安处大乘，是名‘乘力’。

第三力者：如菩萨行境清净经云：‘若诸菩萨居舍宅时，发如是心：我当不为舍宅暗蔽之所障蔽。’是谓三门一切所作，一切动转，皆为利益一切有情。又复能以神境威力、三摩地力，真实如是成就利益，是名‘普遍修行功德力’。

第四力者：如于热那落迦［即热地狱］，化现慈三摩地云，降澍雨流，安处于乐，如是能于十方世界普遍发放慈三摩地，是名‘普能遍满大慈力’。

第五力者：梵天、自在天等一切福德，不能敌其一毛孔许所有福德，故其福德抑蔽一切，刹那刹那摄受无量福德聚积，是名‘普遍贤善福德力’。

第六力者：于诸工处、巧处、业处、世间诸论、菩萨学处，一一刹那无滞无碍而能趣入，是名‘无有滞碍大智力’。

第七力者：诸法本际真实性中，遮止灭除所余粗识游行，于真实际，一刹那间能平等入，能平等出，是名‘般若力’［即胜慧力］。

第八力者：此中有如极粗欲心，亦能长养无漏道体；其身语中最极不善（107），亦能转变为最胜道。于不思议成熟有情方便异门，皆能善巧，是名‘方便力’。

第九力者：谓能获得若于一一刹那，更相间杂最极寂静及未寂静之边际心，若于一一刹那，更相间杂诸有漏心及无漏心（108），若首楞严（109）、若虚空藏、若无垢等（110）诸三摩地，是名‘静虑力’。言静虑者，谓三摩地。

第十力者：依止如前所说诸事，便有无上菩提之力，谓自相续能速成就诸佛难思功德之力，是名‘大菩提力’。

如是十力，于自相续，一切皆能真实引发，是故说云：‘皆引发’。其神境等十种功德，即此中力。得上地时，渐有威力，诸违逆品不能为害，故名为力（111）。

戊三、修习对治（第一四九至第一五二句）

善能清净诸业力，  普能损伏烦恼力，
一切魔力令无力，  善能圆满贤行力。

谓能净治生死所摄有漏业力，普从根本而能损伏根本烦恼、随烦恼等诸烦恼障。若蕴魔等四魔（112）魔力，令其无力，谓能灭绝彼等力能，由修对治诸违逆品殊胜力故，有善（能）圆满普贤行力。佛护、吉祥月二师，谓得八地时，便能断除烦恼障根。是故断除业与烦恼二种过失，应是八地。四魔无余悉能断者，尔时即是佛薄伽梵（113）。然亦获得大乘不退转相者，已能远离诸天子魔；得八地时，于余三魔能断粗者。故此中义，应如是解（114）。

戊四、菩萨作业（第一五三至第一六○句）

善能净治刹土海，  善能解脱有情海，
善能观察诸法海，  善能通达于智海，
善能清净诸行海，  善能圆满诸愿海，
善能供养诸佛海，  修行无倦经劫海。

所言‘海’者，谓是无边，无可推算之义。自于彼处当来成佛诸佛土海，善能修治其中器界、情界过失，令得清净，有如极乐佛净土等。由三神变（115），善能解脱诸‘有情海’有寂怖畏（116）。善以慧眼，别别观察证悟教法、证法所摄诸法。善能通达，顿时趣入无量无边尽所有相广大智海。言‘通达’者，谓能现证。善能清净若智资粮，即菩提行；若福资粮，即诸贤行；二中所摄菩萨‘行海’。言‘清净’者，谓能净治，不染垢秽。善能圆满十无数洛叉大愿等菩萨愿海，善能兴起普贤供云，恒时供养十方佛海。又复于上七种事业，乃至劫海中间无有厌倦，以精进波罗密多力而勤修行。如是八种如海事业，一一刹那修行无阙，此名‘毕竟圆满’十地经中所说菩萨十自在（117）及十力等，为得十地法云地时主要事业。然其同分，十地以前亦有现者。

上来所说圣者地愿，今于初业诵愿文时，令其作意圣者菩萨事业行相，起猛（利）胜解。从净治门而发愿已，名从今始于高地道，令其修习趣进熏习殊胜法门。所余多种甚深共许教授，亦不能及随一少分，故于此中当勤励力。

戊五、随学有二：（己一、随学如来。己二、随学菩萨。）

己一、随学如来（第一六一至第一六四句）

所有游于三世佛，  菩提行愿广差别，
为依贤行现菩提，  一切无余我圆满。

所有游于三世诸佛，彼等为证无上菩提故，行菩提行。尔时所发有如大海广差别愿，于彼一切，我依普贤行愿之力，为现菩提而得佛位，即今为始一切无余毕竟圆满。此是纯一自内，毕竟圆满一切三世佛愿无余愿。

己二、随学菩萨（第一六五至第一七六句）

一切如来有长子，  彼名号曰普贤尊，
为与善巧同等行，  回向今此一切善。
身语意业皆清净，  诸行清净刹清净；
贤巧云何善回向，  愿我与彼皆同等。
为行普善贤行故，  修行文殊师利愿，
尽未来劫无厌倦，  满彼事业尽无余。

一切如来长子菩萨，彼何所名？谓彼十方诸佛菩萨异口同音，号曰‘普贤’，名闻昭示一切刹土。为学与彼善巧方便摩诃菩萨同等广行，故今回向此一切善。以云何相而能同等？谓身清净，语清净，意清净，行清净，刹土清净。如是五种，其清净相皆能同等。释迦知识云：‘身清净者：显示自身调伏色相，显示于彼一一微尘佛刹土中尔许数身，显示一身引满一切佛刹，显示亲近不动诸佛足下。语清净者：谓如一音中围，善能显示一切言音。意清净者：刹那刹那菩萨行海皆现在前。行清净者：谓波罗密多行、静虑行、三摩地行，一一刹那无余清净。刹土清净者：依止如前四清净已，其佛土中器界、情界广大丰盛，一一刹那亦令清净。’即依如是等相，云何贤妙善巧普贤菩萨行回向法，我亦于是五种皆能同等。又为正行普极微妙初、中、后善（118）深广（119）贤行故，修行圣者文殊师利之愿。此圣文殊，名虚空王，谓彼菩萨起如是誓，发如是愿：于流转中，无始无终，最后乃至遍虚空界一切有情，普为成就无量利益。是名：愿与普贤、文殊二大菩萨同等行，同等回向，及同等愿。又令中间不退、不舍到究竟故，普于未来一切劫中，永无厌倦，励力精进于彼诸事业。‘彼事业’者，谓彼诸行。于一切行皆能圆满，是名‘满彼事业尽无余。’如是起誓，如是发愿。此中正明二大菩萨善巧方便波罗蜜多力、般若波罗蜜多力，望彼所余诸大菩萨（120），至极胜出（121）。

戊六、总结事义（第一七七至第一八○句）

所应修行无有量，  一切功德亦无量，
安住无量诸行已，  晓了彼等诸神变。

如上所说一切菩萨广大之行，无不圆满，所应担荷实‘无有量’，谓非算数譬喻所能取量，广大无边。而其功德无量亦尔，谓能获得菩萨难思身语意密一切功德。安住如是无量行已，于彼十方诸佛菩萨无量神变皆能晓了。言‘晓了’者，谓能现证。

有一类疏说此颂文，合于广大补佛（122）［亦名补处］之地。谓前所说诸菩萨行及诸功德，于此地中毕竟能满边际之相，不久时中，获得十方一切如来放广大光为灌顶等，晓了彼等一切神变。如是说者似极善通。

丁三、感得愿果之量（第一八一至第一八四句）

虚空岂是尔许边，  无余有情边亦然，
岂业烦恼边尔许，  我愿亦岂尔许边。

谓如‘虚空’无尔许方，或尔许时边际之相可能执取。‘无余有情’其边亦然，无有边际可执取故。以是义故，一切有情业界、烦恼界，无有若数、若量可能执取，唯是无边。如是，有情及有情业、有情烦恼皆无有边。我若发起上说诸愿，此一切愿决定亦无一一唯有‘尔许边’际。谓于虚空尽际一切有情，虽一有情不令遗余，普令彼等一切业尽、一切烦恼尽，安处无上菩提大乐，故应成就如是大愿。由此相故，名为感得彼愿之果。此如现证法王如来正觉位时，由彼往昔发心之力及与愿力，乃至安住虚空处中无功用行，亦复无有少分分别，尽虚空际一切有情，如其所应，悉令安处无上菩提。如是事业恒常无间，任运成就（123）。

上来广说愿正行竟。寂天菩萨云：‘此贤行愿，与菩萨十无数洛叉大愿经（124）中所说相合。’彼经所说十大愿者：一、以一切种上妙供具，供养无边一切如来愿。二、摄受防护一切正法愿。三、十方诸佛一切有作十二种难思事业者，以无碍身我诣其前，作胜事业愿［谓顶礼、敬事、供养、劝转法轮等］。四、恒行一切菩萨行愿。五、我能成熟一切有情愿。六、引发无边世界，令作当来成佛刹土愿。七、诸所引发一切土中，亦有无边不可思议所行境界诸大菩萨所充满等，净治纯一清净无边愿。八、一切菩萨与己同一意乐加行愿。九、修一切行唯为成就无边上义愿。十、普于一切虚空边际，示现无边如来事业之相，现证圆满菩提愿。十地经（125）云：‘菩萨如是安住菩萨欢喜地，发诸大愿，起如是大方便、如是大行成就。所谓无余一切诸佛，一切供养一切恭敬故，一切种具足，上深信清净。广大如法界，究竟如虚空，尽未来际，尽一切劫数、一切佛成道数，大供养恭敬无有休息（126）。’

又发大愿：所谓一切诸佛所说法轮皆悉受持故，摄受一切佛菩提故，一切诸佛所教化法皆悉守护故。广大如法界，究竟如虚空，尽未来际，尽一切劫数，一切佛成道数，摄护正法无有休息（127）。

又发大愿：所谓一切成佛无余一切世界住处，从兜率天来下，入胎，及在胎中，初生时，出家时，成佛道时，请转法轮时，示入大涅槃。我于尔时，尽往供养摄法为首，一切处一时成一时转故。广大如法界，究竟如虚空，尽未来际，尽一切劫数，一切佛成道数，尽往摄法无有休息（128）。

又发大愿：所谓一切菩萨所行广、大、无量、不杂，诸波罗蜜所摄诸地、所净生诸助道法，总相、别相、同相、异相、成相、坏相，说一切菩萨所行如实地道，及诸波罗蜜方便业，教化一切，令其受行心得增长故。广大如法界，究竟如虚空，尽未来际，尽一切劫数、行数，增长无有休息（129）。

又发大愿：所谓无余一切众生界，有色、无色、有想、无想、非无想、非想非非想，卵生、胎生、湿生、化生，三界所系，杂入六道一切生处，名色所摄，为教化成就一切众生界，令信入诸佛法故，断一切世间数道故，令住一切智智处故。广大如法界，究竟如虚空，尽未来际，尽一切劫数、一切众生界数，教化一切众生无有休息（130）。

又发大愿：所谓无余一切世界，广大、无量、粗细、乱住、倒住、正住，如帝网差别，十方世界无量差别入，皆现前知故。广大如法界，究竟如虚空，尽未来际，尽一切劫数、一切世界数，信入无有休息（131）。

又发大愿：所谓一切佛土一佛土，一佛土一切佛土，一切国土平等清净，一切佛土神通庄严，光相具足，离一切烦恼成就清净道，有无量智慧众生悉满其中，入佛上妙平等境界故，随诸众生心之所乐而为示现故。广大如法界，究竟如虚空，尽未来际，尽一切劫数、佛国土数，清净一切佛土无有休息（132）。

又发大愿：所谓一切菩萨同心同行故，共集善根无怨嫉故，一切菩萨平等一观故，常亲近诸佛菩萨不舍离故，随意能现佛身故，自于心中悉能解知诸佛神力、智力故，得不退随意神通故，悉能游行一切世界故，一切佛会皆现身相故，一切生处普生其中故，成就不可思议大乘故，具足行菩萨行故。广大如法界，究竟如虚空，尽未来际，尽一切劫数、一切行数，入大乘道无有休息（133）。

又发大愿：所谓乘不退轮行菩萨行故，身口意业所作不空，众生见者即必定佛法故，闻我音声即得真实智慧故，心喜恭敬即断烦恼故，得如药树王身故，得如如意宝身故，行大菩萨行故。广大如法界，究竟如虚空，尽未来际，尽一切劫数、一切行数，所作利益不空，无有休息（134）。

又发大愿：所谓于一切世界处成阿耨多罗三藐三菩提故。于一凡夫道，不离一切凡夫道处，示身初生，坐道场，成佛道，转法轮，度众生，示大涅槃。现诸佛境界大神通智力，随一切众生界所应度者，于念念中示得佛道，度诸众生灭苦恼故。以一三菩提，遍知一切法如涅槃性故。以一音说，令一切众生心皆欢喜故。示大涅槃而不断菩萨所行故，示大智慧地，发起一切法故，法智通、如意神通、幻通，遍一切世界故。广大如法界，究竟如虚空，尽未来际，尽一切劫数、成三菩提数，求大智慧、大神通等，无有休息。诸佛子菩萨，如是安住菩萨欢喜地，发诸大愿，起如是大方便、如是大行，以十愿门为首，生如是等满足十百千万阿僧祇大愿。是菩萨住菩萨欢喜地，起如是等愿（135）。

以十尽句成诸大愿。何等为十？所谓：一、众生界尽，二、世界尽，三、虚空界尽，四、法界尽，五、涅槃界尽，六、佛出世界尽，七、如来智界尽，八、心所缘界尽，九、佛境界智入界尽，十、世间转法智转界尽。如众生界尽，我愿乃尽。如世界尽，如虚空界尽，如法界尽，如涅槃界尽，如佛出世界尽，如佛智界尽，如心所缘界尽，如佛境界智入界尽，如世间转法转智转界尽；若彼界尽，我愿乃尽。如是众生界尽不尽，我此善根亦不可尽。世界尽不尽，虚空界尽不尽，法界尽不尽，涅槃界尽不尽，佛出世界尽不尽，如来智界尽不尽，心所缘界尽不尽，佛境界智入界尽不尽，世间转法、转智、转界尽不尽，我此诸愿善根亦不可尽（136）。

彼第一愿，即第四十九句至第五十二句‘供养过去一切佛，现住十方世界佛，未来意乐速圆满，依次现证佛菩提。’及第一百五十九句‘善能供养诸佛海’。

其第二愿，即第一百零一句至第一百零四句‘摄持一切佛正法，普能光显菩提行，极善净治其贤行，尽未来劫常修行。’及第一百五十五句‘善能观察诸法海’。

其第三愿，即第一百三十七句至第一百四十句‘所有未来世间灯，次第成佛转法轮，示现涅槃究竟寂，诸世尊前我往诣。’

其第四愿，即第一百五十七句‘善能清净诸行海’。

其第五愿，即第一百五十四句‘善能解脱有情海’。

其第六愿，即第一百五十三句‘善能净治刹土海’。

其第七愿，即第一百三十五句至第一百三十六句‘如是无余一切方，趣入庄严诸佛土’。

其第八愿，即第一百六十七句至第一百七十六句‘为与善巧同等行，回向今此一切善。身语意业皆清净，诸行清净刹清净，贤巧云何善回向？愿我与彼皆同等，为行普善贤行故，修行文殊师利愿，尽未来劫无厌倦，满彼事业尽无余。’

其第九愿，即第一百四十三句至第一百四十八句‘普遍修行功德力，普能遍满大慈力，普遍贤善福德力，无有滞碍大智力。般若方便静虑力，大菩提力皆引发。’及第一百六十一句至第一百六十四句‘所有游于三世佛，菩提行愿广差别，为依贤行现菩提，一切无余我圆满。’

其第十愿，即第一百八十一句至第一百八十四句‘虚空岂是尔许边，无余有情边亦然；岂业烦恼边尔许，我愿亦岂尔许边。’

如是以上所说为例，观察一切前后文义，当审了知相合之相。

丙三、作意思惟此愿胜利，有二：（丁一、现法胜利。丁二、余生胜利。

初复有四：（戊一、摄受殊胜福德。戊二、远离恶趣恶友，亲面瞩对如来。戊三、善得应得，获与菩萨同分。戊四、永尽业障。）

戊一、摄受殊胜福德（第一八五至第一九二句）

若以十方无边刹，  众宝庄严供如来；
复以人天最胜乐，  刹尘数劫常奉献。
若有闻此回向王，  随顺胜解大菩提，
暂一于此能生信，  获胜福德过于彼。

所言‘若’者，或有一类众生之义，谓有一类众生以极微妙七宝（137）庄严，充满‘十方无边刹’土，清净信心供献十方诸佛世尊。复以顺合人天胜妙资具（138），能生胜乐甚奇希有诸受用物，作诸敬事，经历时分，乃至刹尘数等无边劫中，恒时奉献。如是供养，所获福德不可思议。若有众生，闻此普贤回向王已，心怀喜悦，于其文义，正忆念已，随喜最胜菩提因果之相，而深‘胜解’（139），暂一生起极清净‘信’。如是众生，获胜福德。谓能积聚望前福德，倍复增上大福德。以要言之，于此愿中，所供养事至极广大，作供养时至极长久，供养境界至极边际，供养相状至极恭敬，即便能有供养福德。正念其义，暂一作意观修，亦能获得极大福德。

戊二、远离恶趣恶友、亲面瞩对如来（第一九三句至第一九六句）

诸有发此贤行愿，  彼能远离诸恶趣，
彼亦远离诸恶友，  彼速亲睹无量光。

诸有具足净信众生作意义理，而能发起‘此贤行愿’。谓若如理随顺修已，彼由是缘，远离谤法（140）、违善知识、犯福田等（141）生恶趣因，故能远离一切恶趣。又彼补特伽罗由是因缘，亦能毕竟远离一切恶友。言‘恶友’者，谓不信三宝，及邪见等不善朋畴，退出大乘趣入小乘诸恶伴侣。既远离已，亦能由彼补特伽罗经不久时，速疾亲睹相好庄严无量光身。此中显示，非唯远离生恶趣因一切恶业，生恶趣缘一切恶友，将舍命时，亲面瞩对无量光佛；自相续中，若有往昔诸生所积，生恶趣因诸种恶业，亦能摧坏发果机缘，而得往生清净佛土。

戊三、善得应得，获与菩萨同分（第一九七至第二○○句）

善得应得乐安养，  今此人寿亦善来，
经时不久彼当得，  有如普贤所成就。

又复由彼，补特伽罗于诸受用大乘法中，若善知识、若诸朋畴、若妙处所、若资具等一切顺缘，任运摄受。所‘应得’者，皆能善得。于诸有情能生苦楚、病等恶缘，亦于此中转成菩提心，及修行助伴（142），身心由乐而得安养。即于今此人寿中间，亦由诸佛菩萨之所加持，善来此世他世一切义利。言‘善来’者：谓善成就。彼补特伽罗经时不久，当能获得有如‘普贤所（已）成就’。谓当获得有如普贤，若心、若行、若其功德、若其福德。言‘不久’者：谓是速疾。以要言之，‘彼’即此世于能受用大乘法中，一切顺缘及与一切意乐加行，展转胜进，悟入诸佛菩萨加持，轻易成就此世他世一切义利，获得速疾于地、于道（143）最胜通达。

戊四、永尽业障（第二○一至第二○四句）

诸造极恶五无间，  皆由无知增上力；
愿彼称诵此贤行，  速疾无余悉清净。

一、害母，二、害父，三、害阿罗汉，四、破僧，五、于如来所，恶心出血；‘五无间’罪补特伽罗，皆由‘无知’。谓无简择应取、应舍觉慧之力，愚痴‘增上’。彼等能于此贤行愿，意念其义，胜解俱心，善‘称诵’已，即于此世无间业障能令‘无余’。谓无少分余果可受，悉能灭除清净令尽。五无间者，不善业中名至极重，亦即此世能令‘清净’，况复所余！此中专为显示净治业障，其力极大。

丁二、余生胜利，有二：（戊一、因所摄；戊二、果所摄。）

戊一、因所摄（第二○五至第二○八句）

智与形色诸相好，  种姓容颜悉具足，
诸魔外道无力能，  普为三界所应供。

诸有补特伽罗以贤行愿为其本愿，所余一切未来生中，随所受生，天人趣中，知诸明处（144），圆满无碍趣入之智，两唇圆藏，诸妙形色，首如伞盖，极圆满等诸种相好，有如王种尊贵种姓，若金色等圆满容颜，悉能具足。于菩提道作障碍魔，恶悉弹多（145），及趣邪道诸种外道，亦无力能障此补特伽罗之道。复由福力，及与智力，能摧伏他，普为三界一切天人趣中所应供养，所应礼处。

戊二、果所摄（第二○九至第二一二句）

速诣菩提树王下，  到已安住为利生，
降伏一切魔部众，  成等正觉转法轮。

诸有补特伽罗，能以此愿为其本愿，速疾趣进道究竟已，疾诣菩提树王之下。既到彼已，为令成就一切有情无上菩提大利益故，以金刚跏趺坐而住，从金刚喻三摩地门（146），降伏魔军所有部数百俱胝，现证无上菩提佛位，转于甚深广大法轮。

丙四、诵持文等一切胜利，有五：（丁一、总摄。丁二、即以诵持贤行善根，随学菩萨回向。丁三、随学如来回向。丁四、断除诸障，摄受殊胜清净依身。丁五、获得记别，成办有情义利。）

丁一、总摄（第二一三至第二一六句）

诸有于此贤行愿，  受持开演读诵者，
异熟唯佛能证知，  得胜菩提勿疑惑。

诸有具足信心众生，于此贤行愿经，或记诵文句而自‘受持’，或广为他宣说开示，或复高声‘读诵’经卷，或问论等（147），彼异熟中，获得不可思议出世丰满，唯佛如来乃能证知所行境界，声闻、独觉于此福德，亦复不能通达边际。此为能得无上菩提最胜方便，不应疑惑，应离异觉。谓：求现证前后文中所明胜利，其最胜因，于佛圣言断除疑惑，信顺而信，为其主要。最后一句，亦可加于一切前后颂文后方。

丁二、即以诵持贤行善根，随学菩萨回向（第二一七至第二二○句）

文殊勇猛如实知，  普贤菩萨亦如是，
我普于彼随学故，  回向今此一切善。

此第一句，藏土余译有云：‘文殊如实知、勇猛。’谓文殊菩萨以其慧剑，善巧斩断我执无明军众命根之法，故名勇猛。彼以三轮无分别慧之所摄受，如实了知一切善根回向广大菩提之法，名如实知。圣者普贤菩萨，亦依如是无上方便法门，至极善巧回向其善。复有所余观自在、除盖障等诸大菩萨，普于彼等云何修学，我亦随学回向今此诵贤行等一切善根。

丁三、随学如来回向（第二二一至第二二四句）

三世诸佛咸称赞，  如是回向最殊胜；
我亦普以此善根，  回向为令依贤行。

游于三世诸佛如来，称赞如是回向之法第一最胜。谓令乃至三有常住中间，盖虚空际一切有情，增长无上利乐法筵故，以诸善根回向，为当证得最胜菩提位因。我亦依止如是之法，普以今此诵持贤行愿等善根，回向令依普贤行门，为当证得大菩提因。释迦知识云：‘言如是回向者，谓以三轮不可得法而作回向。’寂天菩萨云：‘从文殊勇猛如实知’起，此二颂文，总摄前说一切大愿。

［梵、藏行人，若时无暇诵经全文，唯诵二颂］

丁四、断除诸障，摄受殊胜清净依者（第二二五至第二三二句）

愿我临欲命终时，  普能扫除一切障，
亲睹如来无量光，  即得往生极乐土。
到彼土已令此愿，  一切无余悉现前；
无余彼愿我圆满，  利益世间诸有情。

依此善根，我命终时。谓于正当舍此依身现在前时。无间业等，名为‘业障’；若邪见等，名‘烦恼障’；若依于彼，不堪见谛，名‘异熟障’（148）。一切三障，弃舍远离而扫除已。将舍命时，为我眼根现前所行，无量光佛、二长子等大众围绕，皆善睹见。由彼悲力及我愿力，舍命无间，无滞无碍往极乐土。到彼土已，愿增上力，受得清净意自性身。今此上说十大愿等一切愿义，皆得现前。既现前已，我于彼等愿义无余，毕竟圆满。乃至世间流转未空，我于彼中一切有情，悉为成办现前利益、究竟利益。

丁五、获得记别，成办有情义利（第二三三至第二四○句）

彼佛中围贤调悦，  我从端严妙莲生，
亲睹如来无量光，  我于其中得记别。
既得如来记别已，  化众多身百俱胝，
依觉慧力遍十方，  广作利益诸有情。

‘彼佛’，谓无量光佛。诸佛中围有二圆满：一、净土圆满。二、眷属圆满。如是中围圆满处所，愿力所成，故名为‘贤’。二种资粮及大乘法，广大丰盛，故名‘调悦’。我于彼处，从其种种光鬘端严，七宝妙莲孔中，无碍化生，亲面瞩对无量光佛。彼以右手摩抚我顶，而告我言：‘善男子！汝于当来成佛世界，与此土同。’我于其中，如是获得最胜无上菩提记别（149）。我于彼处，依如是相得记别已，一刹那顷以神境力，化百俱胝（150），众多化身，遍散分布。如是化身，由方便波罗蜜多、般若波罗蜜多觉慧力故（151），依于众多解脱之门，成办安处十方有情最胜无上菩提利益。

（第二四一至第二四八句）

我今发此贤行愿，  随有所积少分善，
愿彼有情诸善愿，  刹那一切悉相应。
以此贤行愿回向，  所获福德胜无边，
沉溺苦海诸有情，  往生无量光佛土。

此二颂文，陈那疏中，阙而不现。释迦知识疏中，虽有其文，然其辞句略有殊异。

‘发’、即口诵心思，谓于口诵其文，心思义等（152）。所有我所积集少分三门之善，以此力故，一刹那顷，令尽所有十方有情，发起顺合白品善愿，一切相应。此即现时成就合法希愿义利。又以今此读诵思惟普贤行愿善根，回向无上菩提，我能获得微妙福德；此望所余诸世间善，是名为‘胜’。乃至虚空常住中间，福德资粮无有穷尽，是名‘无边’。以此力故，一切有情为业、烦恼之所自在，沉溺广大生死苦海，诸衰逼恼，速疾令其解脱苦海，受生无量光佛悲愿所成最胜刹土。如是等类功德资粮，有如大海，悉能获得。

（第二四九至第二五二句）

今此愿王胜中尊，  能利无边诸有情，
成满普贤庄严文，  恶趣相续无余灭。

此为藏土遍照译师所造愿文，非经正文。今说其义，谓此贤行愿王，是佛如来亲口所说，加持广大。总摄一切菩萨大愿，义利广大。所有愿中，以此为胜，为愿中尊。即于其文，读诵思惟，或演说等，便能利益无边有情。言‘成满普贤庄严文’等者：此中成满，释为‘弘广’。‘文’、即理趣。谓若弘广以普贤行之所圆满庄严理趣，恶趣为首一切流转相续，悉能空灭，速疾圆满一切有情所求无上菩提大乐。

圣言量中，谓贤行愿，义利广大，加持亦大。暂一读诵经中文句，尚能出生难思胜利，况复如理思惟其义！如来实语，从无虚诳。依信顺门，励力修习，即是获得贤妙依身，具足义利最胜方便。颂云：

无算如来及佛子，  诸如海行如海愿，
圆满摄此胜经中，  咸称三界唯一宝。
业所自在生末世，  饱受善恶深厌离，
今逢希有大乘道，  念此胜缘勤策励。
智者既遇无垢教，  微细所作离散乱，
精进修行圣教藏，  我今合掌而启请。
牟尼密意深且细，  以我愚夫极愚者，
当有倒释经义过，  至心露于菩萨所。
愿此精勤所积善，  我与有情时不久，
俱到普贤行海边，  同登能仁大雄位。

吉祥圆满

圣者贤行愿王释义

［自序注释］

（1）不空三藏所宗梵本，犹存于世。近今日本其中堂所影印之普贤行愿赞梵本，私考即其文也。是斯对照不空译文，‘普贤行’三字皆于梵字之旁，以朱笔注明‘贤行’二字。

（2）印度注释。

（3）普遍皆善，无有一种烦恼所使。

（4）西藏称印度为梵土，或圣地，尊称之辞。吾土古称西域，或称天竺。

［释论注释］

（1）编注：请参见53页：‘上来略述陈那疏义，此与龙猛所造会疏、总义（纲领）、分释（节目）多分相同’，及55页本文作者语：‘今于彼等，亦不意乐广破广立，唯由显说自内宗法，而令了知诸余建立。’按本释论作者  至尊章嘉游戏金刚之传记具善教法严饰中所述，其一生禀承  至尊法王宗喀巴之宗风，以依止佛所授记智者—龙猛菩萨之宗义，开显圣教之本意，令众了知。故‘龙尊俱胝善依止’一语，当指依止智者龙猛菩萨所造释论。

（2）谓菩萨为诸佛之子。

（3）曼殊室利，即文殊师利，亦即妙吉祥菩萨。

（4）即俗所谓登地菩萨。

（5）瑜伽师地论云：‘又此种性，已说名持，亦名为助，亦名为因，亦名为依，亦名阶级，亦名前导，亦名舍宅。’

（6）瑜伽师地论中译为所为。摄大乘论世亲释中，译为所用。如云：‘今造此论有所用者。’

（7）一切大愿，皆以积集资粮，净治罪障，为成就因。

（8）身所依者，谓佛身像；语所依者，谓佛说经；意所依者，谓窣堵坡。

（9）别译‘世间’：始从欲界，乃至有顶，诸萨迦耶皆名世间。

（10）心为能缘，心所对境名为所缘。缘者，攀缘之义。

（11）师即是狮。释迦知识云：‘狮子摧伏世一切兽，彼一切兽无有气力摧伏狮子。’如是如来不为他论、外论诸兽之所摧伏，普能摧伏一切他外，与狮子同，故名‘狮子’。陈那云：‘一切无所怖畏名狮，天人世间诸佛亦尔。’无所怖畏，与狮子同；现人寿故，亦即是人，是狮子故，名人狮子。

（12）陈那释云：“言‘以清净身语意’者：谓能发起最胜清净。由能发起清净心故，其身与语亦皆清净。”

（13）亦名发起。

（14）十方三世。

（15）有如亲对面前，现瞩现见。

（16）亦名五轮投地。

（17）五轮据地，名为身礼，如瑜伽戒品云：‘下至以身一拜礼敬，是名身礼。’

（18）别称法界性。究竟圆满，遍于十方，名法界性。

（19）瑜伽戒品云：‘下至以心一清净信，随念三宝真实功德，是名意礼。’释迦知识云：“言‘意礼’者：谓能令彼功德自性，皆现在前；又后于彼一切功德，心怀信乐。”

（20）大毗婆论云：‘造是因义。’

（21）善逝：为如来十号之一。

（22）是故不空译云‘以诸音声功德海’。菩提道次第释云：“谓于诸佛功德，堪赞不可穷尽。化一一身，有无量首；化一一首，有无量舌；出和顺音，而广称说。此中‘音’者，即是赞辞。其‘支’者，谓因，即是舌根。‘海’者：众多之辞。”般若所译本经第四十卷长行云：‘各以出过辩才天女微妙舌根，一一舌根，出无尽音声海，一一音声，出一切言辞海，称扬赞叹一切如来诸功德海。’先以言音称说功德，名为语礼。如瑜伽戒品云：‘下至以语一四句颂，赞佛、法、僧真实功德，是名语礼。’

（23）有过其上者。

（24）中围，亦名曼荼罗。

（25）妙高峰亦名须弥山。

（26）菩提道次第释云：“言‘妙华’者：谓人天等处，甚奇希有，诸种散花。言‘鬟’者：谓种种花，编缀成鬟。如是二种，或以真实或以造作。言‘伎乐’者：谓或弦奏，或复吹奏、或敲、或鸣。言‘涂香’者：谓香泥膏。言‘胜伞盖’者：谓诸伞中最胜者。言‘灯明’者：谓酥油等芳香光明，及放光明摩尼妙宝。言‘烧香’者：谓是配合多种能烧香物，或用一种能烧香物。言‘妙衣服’者：谓一切衣中最胜妙者。言‘最胜香’者：谓妙香水堪饮供水，此以能兴芳香之气，遍三千界，如是诸香所薰染水。言‘末香’者：谓以妙香为末，可散可烧。即以此末积为包等或与绘造中围粉色和合，次第高广，有如妙高峰状。言‘一切最胜庄严具’者：谓当一一加于前后方。此复含有众多之义，严饰之义，种种之义。”

（27）无过其上者。

（28）瑜伽师地论云：‘谓从一种，变成多种，如是广说，乃至梵世身自在转，是名神境。’又俱舍论云：‘依毗婆沙所说理趣，神名所自，唯胜等持，由此能为神变事故。诸神变事，说名为境。此有二种：谓行及化。行复三种：一者、运身，谓乘空行犹如飞鸟。二者、胜解：谓极远方，作近思惟，便能速至。三者、意势，谓极远方，举心缘时，身即能至。此势如意，得意势名。此复二种：谓欲、色界。’

（29）旧称三昧。

（30）胜解。

（31）信有三种：一、深欲信，谓欲出离三界轮回，希求佛果。二、清净信，于三宝处，起清净信。三、诚信，心无变迁，决信因果。此中但言二信。

（32）陈那释云：“言‘深心信受贤行力’者，谓于贤行引起胜解，引起信心，决定信顺，由此力故。言‘贤行’者，有多契经说为菩萨种种相状供养。如其所说，故今摄受顶礼供养，是故云：顶礼供养诸如来。”

（33）瑜伽论中已得众具自在菩萨所设供养，与此相同。如彼论第四十四卷云：‘已得众具自在菩萨，化作化身，或一、或二、或复众多，乃至百千俱胝等数。此一切身，皆于如来及制多所，恭敬礼拜。复从如是一一化身，化出多手，或百、或千、或过是数。此一切手，皆持无量过诸天上妙华香，殊胜可爱种种珍宝，奉散如来及制多所。复从如是一切化身，化出无量上妙音声，歌赞如来广大甚深真实功德。后从如是一切化身，化出无量最上最妙环瑕璩印宝庄严具，幢盖、旛灯种种供具，供养如来及以制多。如是等类，已得众具自在菩萨所设供养，皆养自心。如是菩萨，不更希求如来出世，何以故？由此菩萨已得证入不退转地，一切佛土往来供养，皆无碍故。’

（34）旧译果报。

（35）谓作者、作具、作业。三轮无性，即三轮体空。

（36）言‘别别’者：谓非总悔，应分别悔。广如汉译戒品纂释所明。

（37）菩提道次第释云：“依止三毒而为其因，以身、语、意为其所依，我所造作为其自性。又此自性，复有三种：一、亲自所作；二、教令他作；三、于他所作起随喜。所言‘诸所造作’者：谓总摄一切所造罪恶，应令此等所有过患，悔愧已往，陈护当来，以至诚心而露悔已，往昔已作，断除增长，诸未来者，令其断灭。”

（38）亦名缘觉，又名辟支佛。

（39）即凡夫。

（40）所言趣者，如大毗婆沙论云：‘是诸有情所应往，所应生结出处，故名趣。’瑜伽师地论二卷云：‘如是安立世界成已，于中五趣可得。’般若本经第四十卷长行云：‘一切世界、六趣、四生，又此六趣，别称六道。’

（41）亦名现等觉，又名阿毗三佛陀，谓佛成正觉。

（42）瑜伽三十八卷云：‘所知障断故，于一切所知无碍无障智；复有异门，谓清净智、一切智、无碍智。’

（43）佛动成道已，不即说法，经尔许时，有劝请者，方转法轮。此颂第二句，梵本意谓菩提道次第清净圆满，获得无碍。陈那释云：‘菩提道次第清净圆满者，谓于无上菩提现净满已，即是现等正觉之义。言无滞者，谓即由彼现菩提力，了知无余一切事性，越度所有一切滞碍。’

（44）佛地经论云：‘令修善因，名为利益；令得乐果，名为安乐。又令离恶，名为利益；令其摄善，名为安乐。又拔其苦，名为利益；施与其乐，名为安乐。此世他世，世出世等，应知亦尔。’

（45）涅槃者，谓一切依，皆寂灭故。或名泥洹、名灭、名寂灭、名圆寂、名灭度。

（46）诸身口意三业之善，固不可拔，故谓之根。又由此善能生妙果，能生余善，故谓之根。

（47）此如摄大乘论三卷云：‘一、方便善巧波罗密多，谓以前六波罗蜜多所集善根，共诸有情，回向无上正等菩提故。’

世亲释云：‘共诸有情者：谓于此善共诸有情，如所共有。今当显示：谓以此善，愿求无上正等菩提，作诸有情一切义利，要证菩提此意方遂。是故若有如有思惟：所有善根皆悉回向无上菩提，作诸有情一切义利，如是名为共诸有情。方便善巧显示般若及以大悲：谓以前六波罗蜜多所集善根共诸有情，此由大悲回求无上正等菩提，不求帝释等富乐果。由了知故，不起烦恼，此即般若。’

（48）菩提道次第释云：‘此中敬礼、供养、劝转法轮、请不涅槃、随喜福善，如是五支，名为积集顺缘资粮。悔罪一支，名为净治逆缘诸障。为令长养自善事故，随喜品中，于自作善亦修庆喜。回向一支，谓令于所已积集、所已净治、所已长养诸善，虽极欲少，增为多广，及现在世所感果将罄尽者，令永无尽。以要言之，此为积集、净治、增长无尽，三种所摄。’

（49）意乐，即是思。

（50）离苦得乐之道，获十善业道之道，成佛之道。

（51）陈那云：“言‘愿无错误’者：谓当愿其恒常远离身心疾病。”释迦知识云：“言‘愿无疾病’者：谓当愿令一切时中，解脱无余其俱生苦，及诸客苦之义。言‘众生法利悉顺成’者：谓令无余有情成就法求。言‘法利’者：谓获法利，永不离失十善业道，即名为获。言‘顺成’者：谓彼于法，无有修行及防护等一切烦恼，至极顺适。言‘所有意望亦成满’者，此中意望，是彼有情所有意乐。谓诸有情为欲成就所求义利所有意乐，亦复令其圆满成就。

上来三颂，明胜解行所摄发菩提心。”

（52）于过去生自体差别，明了记忆，名念宿住。别译宿命通。

（53）即念本生。瑜伽论云：‘又由随念宿住智故忆念本生。’

（54）愿菩提心及趣入菩提心，广释于拙译戒品纂释卷上第五十九页。

（55）谓律仪戒、摄善法戒、饶益有情戒。广释于拙译戒品纂释中。

（56）亦名夜叉，又名捷疾鬼。

（57）即瓮形鬼。

（58）瑜伽师地论第八十一卷云：‘能治义者，以要言之，一切清净行。如贪是所治，不净为能治；嗔是所治，慈为能治。’

（59）谤大乘法，其罪重于五无间业。

（60）所治品，即违逆品。瑜伽师地论第八十一卷云：‘所治义者，以要言之，一切杂染行。四黑法者：一、谓若欺诳亲教、轨范、尊长、诸应供处。二、谓以引起悔愧意乐，令他有情，于其非所应悔愧处，而生悔愧。三、谤说正趣大乘有情恶称、恶名、恶誉、恶声。四、于诸有情，现行谄诳。’

言‘业障、烦恼障’者，如瑜伽师地论第二十九卷云：‘言业障者：谓五无间业及余所有故思造业、诸尤重业。彼异熟果若成熟时，能障正道令不生起，是名业障。烦恼障者：谓猛利烦恼、长时烦恼，由此烦恼，于现法中以其种种，净行所缘不能令净，是名烦恼障。’

（61）瑜伽论云：‘所受异熟，界地决定故，是故约与异熟不可移转，名为不动。’

（62）谓眼所识可爱、可喜、可乐、如意能引欲，可染著色，乃至身所识可爱、可喜、可乐、如意能引欲、可染著触。又五妙欲，别译‘五欲乐’。

（63）瑜伽师地论第二十九卷云：‘云何魔事？谓诸所有能引出离善法欲，生耽著诸欲增上力故，寻还退舍，当知此即是为魔事。若正安住密护根门，于诸所有可爱色、声、香、味、触、法，由执取相、执取随好，心乐趣入，当知此即是为魔事。若正安住于食知量，于诸美味不平等食，由贪爱故，心乐趣入，当知此即是为魔事。若正安住精勤修习初夜、中夜、后夜悟寤瑜伽，于睡眠乐、于偃卧乐、于胁卧乐，由懈怠力心乐趣入，当知此即是为魔事。若正安住正知而住，于往来等诸事业时，若能见幼少盛年美色诸母邑等，由不如理执取相好，心乐趣入；或见世间诸妙好事，心乐趣入；或于多事多所作中，心乐趣入；或见在家或出家众，欢娱杂处，或见恶友共相杂住，便生随喜，心乐趣入，当知一切皆是魔事。于佛、法、僧、苦、集、灭、道，此世、他世，若生疑惑，当知一切皆是魔事。住阿练若、树下、冢间、空闲静室，若见广大可怖畏事，惊恐毛竖；或见沙门、婆罗门像，人、非人像，欻然而来，不如正理劝舍白品，劝取黑品，当知一切皆是魔事。若于利养、恭敬、称誉，心乐趣入；或于悭吝、广大希欲，不知喜足；忿、恨、覆、恼及矫诈等，沙门庄严所对治法，心乐趣入，当知一切皆是魔事。如是等类无量无边诸魔事业，一切皆是四魔所作。随其所应，当正了知。’

（64）瑜伽师地论云：‘我当饶益一切有情，非于有情有所见觅。’

（65）地狱、饿鬼、畜生之趣。

（66）一、福资粮。二、智资粮。

（67）软中上根部分差别。

（68）种性之义。

（69）烦恼品所有粗重随附依身，说名随眠。

（70）所言福智二资粮者，如瑜伽师地论三十六卷云：‘云何为福？云何为智？谓略说福，即是三种波罗蜜多：一、施波罗蜜多；二、戒波罗蜜多；三、忍波罗蜜多。智：唯一种波罗蜜多，谓慧波罗蜜多。精进、静虑波罗蜜多，应知通二分：一者福分。二者智分。若依精进，修行布施，受护净戒，及修慈等四种无量，如是等类所有精进，名为福分。若依精进，习闻、思、修所成三慧，修蕴善巧，修界善巧，修处善巧，修缘起善巧，修处非处善巧，修能观察苦为真苦、集为真集、灭为真灭、道为真道，及于一切善不善法，有罪、无罪，若劣、若胜，若黑、若白，并广分别缘生法中，皆能如实思择观察，如是等类所有精进，名为智分。若依静虑，修习慈等四种无量如是相类所有静虑，名为福分。若依静虑，能修如前精进中说，蕴善巧等如是等类所有静虑，名为智分。如是福智略有六种，一一分别，应知无量。’

（71）以无染心。

（72）谓清净之法眼。

（73）摄大乘论世亲释七卷云：‘法流即说在三摩地处，于定中见诸佛故。’

（75）一、契经，二、应颂，三、记别，四、讽颂，五、自说，六、缘起，七、譬喻，八、本事，九、本生，十方广，十一、希法，十二、论议。

（76）别称八万四千法门。

（77）亦名总持，谓总任持无量佛法，令不忘失。于一法中，持一切法；于一文中，持一切文；于一义中，持一切义。

（78）抉择修行践法理趣，作用轨则。

（79）既抉择已，如所抉择，如实修行。

（80）集论云：‘谓有资粮道，皆是加行道；有加行道，非资粮道。谓已积集资粮道者，所有顺决择分善根。’

（81）瑜伽师地论第四十五卷云：“云何菩萨法陀罗尼？谓诸菩萨获得如是念慧力持，由此力持，闻未曾闻、言未温习未善通利名句文身之所摄录，次第错综，次第结集无量经典，经无量时，能持不忘，是名菩萨法陀罗尼。

云何菩萨义陀罗尼？谓如前说，此差别者，即于彼法无量义趣，心未温习未善通利，经无量时能持不忘，是名菩萨义陀罗尼。

云何菩萨咒陀罗尼？谓诸菩萨获得如是等持自在，由此自在，加被能除有情灾患诸咒章句，令彼章句悉皆神验，第一神验，无所唐捐，能除非一种种灾患，是名菩萨咒陀罗尼。

云何菩萨能得菩萨忍陀罗尼？谓诸菩萨成就自然坚固因行，具足妙慧，独处空闲，寂无言说，曾无有物。见路而行，知量而食，不杂秽食，一类而食。常极静虑，于夜分中少眠多寤。于佛所说得菩萨忍诸咒章句能谛思惟。其咒词曰：‘壹胝  密胝  吉胝毗  □底  钵陀腻  莎诃’即于如是咒章句义，审谛思惟，筹量观察。彼于如是咒章句义如是正行，不从他闻，自然通达。了知如是诸咒章句都无有义，是圆成实，但唯无义，如实了知此章句义。所谓无义，是故过此不求余义，齐此名为妙善通达咒章句义。彼于如咒章句义正通达已，即随此义不从他闻，自正通达一切法义。谓于此义，如是通达一切言说所说诸法自性之义，皆不成实，唯有诸法离言自性是自性义。彼于诸法此自性义正通达已，过此更无余义可求。由于此义善通达故，获得最胜广大欢喜，由是菩萨得陀罗尼，当言已得此陀罗尼章句所立菩萨胜忍。得此忍故，是诸菩萨不久当得净胜意乐，已依上品胜解行地胜忍而转，当知是名菩萨所有能得菩萨忍陀罗尼。

此中菩萨法陀罗尼、义陀罗尼，若过第一无数大劫，已入清净胜意乐地，所得决定坚住广大；从此以下，或以愿力，或依静虑，虽有获得，而不决定，亦不坚住，亦不广大。如说法、义二陀罗尼，咒陀罗尼当知亦尔。能得菩萨忍陀罗尼，如前所释，即如是得。”

（82）名为三有，亦称三界。

（83）别名轮回。

（84）谓四摄事，又复略有六种方便：一随顺会通方便，二共立要契方便，三异分意乐方便，四逼迫所生方便，五施恩报恩方便，六究竟清净方便。广于瑜伽师地论四十五卷。

（85）谓从暖法、顶法、顺谛忍法、至世第一法。

（86）加行无间，此智生时，体会真如，名通达位。初照理故，亦名见道。

（87）由此通达所取能取无性真如故。大般若经第五十二卷云：‘谓若住此三摩地时，于诸垢秽，纵任弃舍，如狮子王自在奋迅，是故名为师子奋迅三摩地。’

（88）现观庄严论云：‘缘佛等净信，精进行施等，意乐圆满念，无分别等持，知一切法胜慧，共为五。此摄道为五法：一、谓于缘佛诸道果法，发起净信。二、于布施等行境，勇悍精进。三、意乐圆满大乘发心所摄正令。四、虚空藏等无分别定。五、二谛所摄诸法，一切种了知胜慧。’

（89）梵土、西藏称师父为父，称徒为子。龙猛之子，即是月称。

（90）器：谓器世界。情：谓有情世界。别称依报、正报。

（91）大乘为内，此外名外。瑜伽论云：外者，内相违义。显扬论云：外者，翻内义。

（92）显扬论云：‘静虑者及诸佛，二种境界中，真如及无漏性，皆不可思议。’

（93）亦名受用身，别名报身。佛地经论云：‘受用身者，一切功德圆满为相，一切佛法共所集成，能起一切自在作用，一切白法增上所起，一切如来各别自体。微妙难测，居纯净土，任运湛然，尽未来际，自受法乐，现种种形，说种种法，令大菩萨亦受法乐。’

（94）释迦知识谓此二颂，明第一地，极喜地。

（95）即六十四梵音。

（96）即是思。

（97）即是种性。

（98）释迦知识谓此一颂，明第二地，离垢地。

（99）知不现见境，名智。

（100）释迦知识谓此一颂，明第三地，发光地。

（101）谓极少时。杂集论云：‘刹那者，谓于所知境，智生究竟，名一刹那。’

俱舍论云：‘众缘和合法，得自体顷；或有动法，行度极微。’对法诸师说：‘如壮士一疾弹指顷，六十五刹那，如是名为一刹那量。’

（102）释迦知识谓此一颂，明第四地，焰慧地。

（103）释迦知识谓此一颂，明第五地，极难胜地。

（104）释迦知识谓此一颂，明第六地现前地。

（105）即十二相成道。大般若经第六分二行品云：‘或现升睹史多，或现从天下生至瞻部洲，或现处胎，或现初生，或现童子，或现游戏，或现出家，或现苦行，或现往诣菩提，或现转法轮，或现般涅槃。’

宝性论教化品云：‘从天退、入胎，现生有父母。在家示婴儿，学习诸伎艺，戏乐及游行，出家行苦行，现就外道学，降伏于天魔。成佛转法轮，示道入涅槃。诸薄福众生，不能求如来。’

（106）释近知识谓此一颂，明第七地，远地行。

（107）瑜伽戒中，开身三不善，谓杀生、不与取、欲邪行。语四不善：谓妄语、离间语、粗恶语、绮语。善巧方便菩萨于诸身语不善，皆能转变为最胜道，而生功德。拙译戒品纂释中广释其义。

（108）此名熏修静虑。如瑜伽十二卷云：‘谓如有一已得有漏及与无漏四种静虑，为于等至得自在故，为受等至自在果故，长时相续入诸静虑有漏、无漏更相间杂，乃至有漏无间、无漏现前，无漏无间还入有漏，当知齐此熏修成就。’

（109）亦名健相三昧，又名健行定、勇健定、勇伏定。大般若经云：‘谓若住此三摩地时，能受一切三摩地境，能办无边殊胜健行，能为一切等持导首，是故名为健行三摩地。’

（110）无垢三摩地，亦名清净三昧。

（111）释迦知识谓此二颂，明第八地，不动地。

（112）一、蕴魔，二、烦恼魔，三、死魔，四、天子魔。广释于瑜伽师地论第二十九卷。

（113）如来十号之一。此有六义：一、自在，二、炽盛，三、端严，四、名称，五、吉祥，六、尊重。

（114）释迦知识谓此一颂，明第九地，善慧地。

（115）瑜伽师地论第二十七卷云：‘三神变者：一、神境神变，二、记说神变，三、教诫神变。’

（116）生死、涅槃二种怖畏。

（117）显扬论：‘一、寿自在，二、心自在，三、众具自在，四、业自在，五、生自在，六、愿自在，七、胜解自在，八、神变自在，九、智自在，十、法自在。’

（118）初善、中善、后善，名为三善。谓其所行，于初、中、后三时皆善也。

（119）甚深贤行、广大贤行。

（120）药师经、般若理趣经、八大菩萨经等，皆说大菩萨八，其名曰：‘妙吉祥菩萨、观自在菩萨、慈氏菩萨、虚空藏菩萨、普贤菩萨、金刚手菩萨、除盖障菩萨、地藏菩萨。’今取方便般若第一，但说二大菩萨。

（121）释迦知识谓上六颂，明第十地，法云地。

（122）亦名补处。

（123）释迦知识谓上二颂，明第十一地，普光佛地。

（124）即十地经所云：十百千万阿僧祇大愿。

（125）附论文。（编注：即十地经论）论曰：‘云何校量胜？菩萨住此地中，胜声闻、辟支佛故。校量胜有三种：一、愿胜，一、修行胜，三、果利益胜。何者愿胜？所谓十大愿。’

（126）论云：‘是初大愿无余者有三种：一者、一切佛无余。二者：一切供养无余。三者、一切恭敬无余。

一切佛者，有三种佛：一、应身佛，二、报身佛，三、法身佛。一切供养者有三种供养：一者、利养供养，谓衣服、卧具等。二者、恭敬供养，谓香、花、旛、盖等。三者、行供养，谓修行信、戒、行等。一切恭敬者，有三种恭敬：一、给侍恭敬，二、迎送恭敬，三、修行恭敬。是故作愿供养恭敬。如经所谓：‘无余一切诸佛，一切供养一切恭敬故。’

‘一切种具足’者，无量种种，复有胜事等供养故。‘上深信清净’者，增上敬重故，愿回向菩提决定信故。‘广大如法界’者，一切余善中胜故。‘究竟如虚空’者，无常爱果无量因故。‘尽未来际’者，此因得涅槃常果故；一切劫数、一切佛成道数，大供养恭敬无有休息故。

此初愿中，有六种大，名为大愿：一者、福田大。如经所谓：‘无余一切诸佛一切供养一切恭敬故’。二者、供事大。如经：‘一切种具足’故。三者、心大。如经：‘上深信清净。’四者、摄功德大。如经：‘广大如法界’故。五者、因大。如经：‘究竟如虚空’故。六者、时大。如经：‘尽未来际’故。”

（127）论云：“第二大愿有三种法：‘一切诸佛所说法轮皆悉受持’者：谓教法修多罗等，书写、供养、读诵、受持，为他演说故。‘摄受一切佛菩提’者：所谓证法，证三种佛菩提法，摄受此证法，教化转授故。‘一切诸佛所教化法皆悉守护’者：谓修行法。于修行时，有诸障难，摄受救济故。

复名三种成就：一者、于诸佛所说修多罗等阿含次第，令法轮不断成就故；二者、证三种正觉，得证成就故；三者、修行，乃至如实修行正觉成就故。是故名三种成就。三种佛菩提者：声闻、辟支佛，亦名为佛故。”

（128）论曰：“第三大愿、‘一切成佛无余一切世界住处’者：一切应佛无边，遍满一切世界住处故，随何等世界，诸佛住处应感相顺众生见故，从兜率天来下，乃至示入大涅槃。‘我于尔时尽往供养摄法为首’者：随彼众生供养佛方便，以如来所说摄法方便，集功德智慧助菩提法故。‘一切处、一切时成一时转’者：示非前后故。

何故示现彼处住，不在色、无色处？此难处来，不为我故；起于轻心，不生恭敬，为遮此等故。何故不住他化自在天等？如来有力能胜处生，舍而不生，为念众生故；来生兜率，如是生大恭敬心故。何故人中舍上天乐？愍我等故，来生人中，生增上敬重心故。何故处胎？示现同生增长力故。何故自成正觉？示非余佛教化，现丈夫力成就，非因他得菩提故。何故示现入大涅槃？为令懈怠众生，勤心修道故。”

（129）论曰：“第四大愿，‘心得增长’者，以何等行令心增长？一切菩萨所行教化一切，令其受行心得增长故。彼菩萨行有四种：一种种，二体，三业，四方便。以此四种教化今其受行。

何者是菩萨行种种世间行有三种。‘广’者：从初地乃至六地；‘大’者，七地；‘无量’者：从八地乃至十地。‘不杂’者：法无我平等观出世间智故。如经：一切菩萨所行，广大无量不杂故。‘体’者，如经：诸波罗密所摄故。‘业’者，如经：诸地所净，生诸助道法故。‘方便’者，如经：总相、别相、同相、异相、成相、坏相故，说一切菩萨所行如实地道，及诸波罗蜜方便业故。”

（130）论曰：“第五大愿，教化众生故。何者是众生？为何义故化一切众生？有六种差别：一、粗细差别：二、生依止差别；三、不净、净处差别，四、苦乐差别，五、自业差别，六、自体差别。

何者粗细差别？粗者有色，细者无色。色中粗者有想，细者无想；无色中粗者非无想，细者非想非非想，是名粗细差别。如经：有色、无色、有想、无想、非无想、非想非非想故。

生依止差别者，如经：卵生、胎生、湿生、化生故。化生者云何依止？依止业生故。

不净净处差别者，如经：三界所系故。

苦乐差别者，种种身故，如经：杂入六道故。自业差别者，如经：一切生处故。

自体差别者，如经：名色所摄故，是名众生。

为何义化者？为三义故。一者、为信入诸佛所说法中，如经：为教化成就一切众生界，令信入诸佛法故。二者、已入佛法中，令入二乘菩提故，如经：断一切世间数道故。三者、已入二乘菩提，令入无上菩提故，如经：令住一切智智处故。’

（131）论曰：“第六大愿，无余一切世界者，有三种相，随入如是世界，智皆现前知。一者、一切相，二者，真实义相，三者、无量相。

一切相者，如经：广大无量乃至正住故。‘广大无量’者，一千世界、二千世界、三千世界故。‘细’者，随何等世界意识身故。‘粗’者，随何等世界意色身故。‘乱’住者，非次第住故。‘倒住’者，不造舍宅住故。‘正住’者，造舍宅住故。是名一切相。‘如帝纲差别’者，真实义相故，如业幻作故。

无量相者，十方世界无量差别入故，无量相故。

真实义相者，唯智能知。余相者，可现见故。”

（132）论曰：“第七大愿，净佛国土相七种：一者、同体净。如经：一切佛土一佛土，一佛土一切佛土故。二者、自在净。如经：一切国土平等清净故。三者、庄严净。如经：一切佛土神通庄严，光相具足故，光明庄严众宝等庄严故。四者、受用净。如经：离一切烦恼成就清净道故。五者、住处众生净。如经：有无量智慧众生悉满其中故。六者、因净。如经：入佛上妙平等境界故。七者、果净。如经：随诸众生之心所乐而为示现故，显智神力等故。”

（133）论曰：“第八大愿，不令余乘故，如经：一切菩萨同心同行故。”

菩萨行有十种：一者、共集善根无怨嫉故。二者、一切菩萨平等一观故。三者、常亲近诸佛菩萨，不舍离故。四者、随意能现佛身故。五者、自于心中，悉能解知诸佛神力、智力故。六者、得不退随意神通故。七者、悉能游行一切世界故。八者一切佛会皆现身相故。九者、一切生处普生其中故。十者、成就不可思议大乘故，具足行菩萨行故。

于中，初句显功德行故。第二、住寂静等观故。第三、聚集解说论佛法故。第四、随心示现成佛故。第五、自发胜心，合如来法身故。第六、得常不退神通故。余四者以通业得名：一、往余世界，二、自余异身示现，三、同生往故，四、入不可思议大乘故。’

（134）论曰：‘第九大愿，显不空行菩萨行，复行菩萨行，显乘不退轮行菩萨行故，于中‘不空’有二种：一、作业必定不空，身、口、意业所作不空故。闻我音声即得真实智慧者，明口业不空。心喜恭敬即断烦恼者，明意业不空。二、所作利益不空。一切众生有二种苦：一、种种诸苦，二、贫穷苦。对治是二，如经：得如药树王身故，得如如意宝身故。”

（135）论曰：‘第十大愿起大乘行，云何大菩提？云何作业？大菩提者，如经：成阿耨多罗三藐三菩提故。作业者，有七种：一、示正觉业。二、说实谛业。三、证教化业。四、种种说法业。五、不断佛种业。六、法轮复住业。七、自在业。

初业者，于一凡夫道不离一切凡夫道处，乃至示大涅槃故。一凡夫道者，一阎浮提义。阎浮提凡夫道者，可化众生住处，名为凡夫道。第二业者，现诸佛境界大神通智力故，随一切众生界所应度者，于念念中示得佛道，度诸众生灭苦恼故，随诸世界一切可化者，随心示现佛身。示现佛身者，除诸难处，彼彼胜处生，示除苦、断集、证灭、修道。第三业者，以一三菩提观法无我，一切法性净涅槃，令众生信解故。第四业者，以一音声，随种种信解可化众生，一时皆令心欢喜故。第五业者，示现大涅槃而不断菩萨所行力故。第六业者，复（往）佛智地一切修多罗等所说法，轨则不失故。第七业，法智通者，观一切法无性相故；如意神通者，自身现生、住、灭，修短随心自在故；幻通者，转变外事无不随意故。初法智通，不住世间故；如意神，通、幻通，不住涅槃故。

何故唯说此十大愿？初愿、功德行满故。第二愿、智慧行满足故。次五愿为教化众生故：一、以何身？二、以何心？三、何者众生？四、众生住何处？五、自身住何处能教化众生？后三愿显自身：一得地校量胜故，二得菩萨地尽校量胜故，三得一切地尽究竟故。此三示现如实教化众生故。发诸大愿者，随心求义故。起如是大方便者，成彼所作方便勇猛故。如是大行者，彼所作行成就故。菩萨住此地，渐次久习起此三行，非一时故。何以故？此十大愿一一愿中，有百千万阿僧祇大愿以为眷属故。如经：诸佛子菩萨如是安住欢喜地，发诸大愿，起如是大方便、如是大行，以十愿门为首，生如是等满足十百千万阿僧祇大愿。是菩萨住菩萨欢喜地，起如是等愿故。何故名大愿？光明善根转胜增广故。此校量菩萨愿胜，有二种胜声闻、辟支佛：一、常勤修习无量行故，二、与一切众生同行故。同行者，十尽句示现。

（136）论曰：‘于中，众生界尽是总，世界尽乃至智转界尽是别。何等是众生界？众生界尽故。何处住？世界尽故；所有虚空界，虚空界尽故。说何法教化？法界尽故。随化众生置何处？涅槃界尽故，佛出世界尽故。以何方便善巧？如来智界尽故，复随所缘心缘界尽故。复随以何界？佛境界智入界尽故。此事已说。尽者：示现不断尽，非念念尽故。此九种尽，略说三种三转示现。此十尽句增上力故，诸佛以此力常为众生作利益故。如是已说愿校量胜。’又如瑜伽师地论第四十五卷云：‘若请菩萨，愿于当来，以一切种上妙供具，供养无量无边如来，当知是名第一大愿。若诸菩萨，愿于当来，摄受防护诸佛世尊所有正法，传持法眼令无断坏，当知是名第二大愿。若诸菩萨，愿于当来，从睹史多天宫降下，如前乃至入大涅槃，当知是名第三大愿。若诸菩萨，愿于当来，行一切菩萨正行，当知是名第四大愿。若诸菩萨，愿于当来，普能成熟一切有情，当知是名第五大愿。若诸菩萨，愿于当来，一切世界皆能示现，是名第六大愿。若诸菩萨，愿于当来，净修一切佛土，当知是名第七大愿。若诸菩萨，愿于当来一切菩萨皆同一种意乐加行，趣入大乘，当知是名第八大愿。若诸菩萨，愿于当来，所有一切无倒加行，皆不唐捐，当知是名第九大愿。若诸菩萨，愿于当来速证无上正等菩提，当知是名第十大愿。’

又第四十七卷云：‘由得清净胜意乐故，为欲供最胜有情、真实福田、大师、法主，是故引发第一大愿。为欲受持彼所宣说无上正法，是故引发第二大愿。为欲劝请，转未曾有妙正法轮，是故引发第三大愿。为欲顺行菩萨行，是故引发第四大愿。为欲成熟彼器有情，是故引发第五大愿。为欲往趣诸佛国土，奉见如来，承事供养，听闻正法，是故引发第六大愿。为净修治自佛国土，是故引发第七大愿。为于一切在所生处，常不远离诸佛菩萨，与诸菩萨常同一味意乐加行，是故引发第八大愿。常为利益一切有情，曾不空过，是故引发第九大愿。为证无上正等菩提，作诸佛事，是故引发第十大愿。’

（137）谓金、银、琉璃、玻璃、砗磲、赤珠、码瑙。

（138）显扬论第五卷云：‘十种资具：一、饮食。二、衣及庄严具。三、众具。四、戏笑。五、鼓舞。六、歌咏。七、音乐。八、香鬘涂饰。九、众明。十、男女承事。’

（139）谓能于境印可。

（140）谓谤正法，此有四相：一、谤说所诠下劣，非智所依，不能引义。二、谤说能诠下劣，非福所依，不能引法。三、谤说作者下劣，非如来说。四、以是义故，谤其不能利益安乐有情。

（141）谓诸应供处：若三宝，若亲教师，若轨范师，若父母等，皆名福田。此为菩萨生起福德所依之处，故名福田。

（142）谓其能以种种恶缘，转（成）菩提道。

（143）地即十地，道即五道，亦名五位。

（144）谈五明处：即内明处、医方明处、因明处、声明处、工业明处。

（145）悉弹多，亦名悉檀。恶悉檀多，谓邪宗、谬理。

（146）亦名金刚喻定。谓最后边学三摩地，上无烦恼能摧伏故，摧伏一切诸烦恼故。譬如金刚，其性坚固，诸摩尼等不能穿坏，穿坏一切摩尼宝等。此定亦尔，故喻金刚。

（147）释迦知识云：‘言受持者：谓能无倒修其文义，不依言音而作称诵。言开演者：谓能为他开演文句，及与义理。言论诵者，谓读诵经卷。’瑜伽八十三卷云：‘言瑜伽者：受持、读诵、问论、抉择、正修加行。’

（148）瑜伽师地论第二十九卷云：‘谓若生处，圣道依彼不生不长，于是生处，异熟果生；或有生处，圣道依处，虽得生长，而于其中异熟果生。聋驱、愚钝、盲瞽、病哑、以手代言、无有力能解了善说、恶说法义，是名异熟障。’

（149）即授记。

（150）亦名那由他，即大千世界之量。

（151）方便为悲，般若为慧；慧悲双转，不舍有情。

（152）如身礼拜等。

"""